{
  "intents": [
    {
      "tag": "akhiri_perbincangan",
      "patterns": [
        "Thanks a lot for your help, goodbye.",
        "Appreciate your assistance, see you later.",
        "Thanks, man! Have a great day.",
        "Thanks for your time and support. Goodbye for now.",
        "Alright, take care and thanks for the info.",
        "Thanks for your cooperation, farewell.",
        "Thanks for looking out for me, byebye.",
        "Thanks for your dedication, goodbye for now.",
        "Thank you once more for the information. Farewell.",
        "Good deal! Thank you, and bye.",
        "Thanks for the update! Catch you later.",
        "Thanks for sharing the information. Wish you a pleasant day.",
        "Thanks again for your help. Okay, byebye.",
        "Thanks for your professionalism. Much obliged, goodbye.",
        "Thanks for your devotion. Thanks again, and take care.",
        "Thank you for the information.",
        "Thanks again, hope we can talk again later.",
        "Thank you very much, hope we can meet again someday.",
        "Thank you for all your support, may you always succeed in everything.",
        "Thank you, may your life be filled with happiness and success.",
        "Thank you for all your cooperation, hope we can have better collaboration in the future.",
        "Thank you very much, may all your efforts and dedication bear fruitful results.",
        "Thank you for your valuable time, may all your wishes come true.",
        "Thank you, may success always accompany you in every step you take.",
        "Thank you for all your guidance, may you always be blessed in your life.",
        "Thank you very much, hope we can continue this conversation another time.",
        "Thank you for your attention.",
        "Thanks for the help. Have a wonderful day!",
        "Appreciate your support. Take care and goodbye.",
        "Thanks a bunch for the info. See you later!",
        "Thanks a million. Farewell for now.",
        "Many thanks. Catch you later!",
        "Thank you kindly. Have a great day!",
        "Thanks for your guidance. Okay, bye.",
        "Thanks for being so helpful. Goodbye for now.",
        "Appreciate the advice. See you soon!",
        "Thanks, you're a lifesaver. Take care!",
        "Big thanks to you. Farewell.",
        "Thanks for everything. Catch you later!",
        "Thank you so much. Have a wonderful day!",
        "Thanks for your time. Goodbye!",
        "Appreciate your input. See you later!",
        "Thanks, and stay awesome. Farewell!",
        "Sending my gratitude. Catch you later!",
        "Thanks for your understanding. Take care!",
        "Thanks, you've been great. Goodbye for now.",
        "Appreciate your efforts. See you soon!",
        "Thanks, and have a fantastic day!",
        "Thanks for your patience. Goodbye!",
        "Appreciate your kind words. Take care!",
        "Thanks for the support. See you later!",
        "Thanks, and be safe. Farewell!",
        "Sending a heartfelt thank you. Catch you later!",
        "Thanks for the valuable information. Take care and goodbye!",
        "Appreciate your prompt response. See you soon!",
        "Thanks, it means a lot. Farewell for now.",
        "Thank you kindly for your assistance. Have a wonderful day!",
        "Thank you very much, may success always be with you.",
        "Thank you for your kindness.",
        "Thank you very much for the information, it's very helpful.",
        "Thank you for the incredible assistance.",
        "Thank you, hope your day is wonderful too.",
        "Thank you for all the clear answers.",
        "Thank you very much, it's been a pleasure communicating with you.",
        "Thank you for your time and effort.",
        "Thank you, may your company continue to be successful.",
        "Thank you for your support.",
        "Thank you, may your day be blessed.",
        "Thank you very much, may all your efforts be successful.",
        "Thank you for your cooperation, hope we can work together again in the future.",
        "Thank you, may your life always be blessed.",
        "Thank you for all your attention and support, I will always remember your kindness.",
        "Thank you very much, you are an extraordinary person, may your steps be multiplied with success.",
        "Thank you for all the valuable advice, I will take them as my guidance in life.",
        "Thank you, may success always be with you in every step you take.",
        "Thank you for all your care, may you always be blessed in your life.",
        "Thank you very much, may all your efforts bring happiness and satisfaction.",
        "Thank you for your hard work, may your dreams be achieved gloriously.",
        "Thank you, may all your dreams come true perfectly.",
        "Thank you for all the valuable advice, may your life be filled with happiness and success.",
        "Thank you very much, may every step you take bring success.",
        "Thank you for all your support and trust, I will always remember them.",
        "Thank you, may all your endeavors be blessed and bear sweet fruits.",
        "Thank you for your hard work, may success always accompany your steps.",
        "Thank you very much, may all your efforts be blessed and yield magnificent results.",
        "Thank you, may your life be filled with blessings and joy.",
        "Thank you for all your attention and support, I will always cherish them.",
        "Thank you very much, may all your hopes and dreams come true.",
        "Thank you for all the help and cooperation, may success always accompany you.",
        "Thank you, may all the goodness you've given return to you manifold.",
        "Thank you for all your hard work, may success always be with you.",
        "Thank you very much, may all your efforts be blessed and bring fruitful results.",
        "Thank you for the information, it's very helpful.",
        "Thank you for your patience and kindness.",
        "Thank you, may your blessings multiply.",
        "Thank you for the good collaboration.",
        "Thank you very much, may all your dreams come true.",
        "Thank you for all the valuable advice and suggestions.",
        "Thank you, you are an excellent worker.",
        "Thank you for the opportunity to talk.",
        "Thank you very much, hope we can collaborate again in the future.",
        "Thank you for your dedication.",
        "Thank you, may success always be with you in everything you do.",
        "Thank you for your kindness and professionalism.",
        "Thank you very much, you are a valuable asset to the company.",
        "Thank you for all the information you've shared, it's very valuable.",
        "Thank you, may all your efforts be blessed and bring great happiness.",
        "Thank you for all your support.",
        "Thank you very much, you are a kind-hearted person.",
        "Thank you for all the valuable advice.",
        "Thank you, may success always accompany you.",
        "Thank you for your precious time.",
        "Thank you very much, hope we can meet again and chat more.",
        "Thank you for all your guidance, may I become better thanks to you.",
        "Thank you, may all your efforts be blessed and bring magnificent results.",
        "Thank you for your hard work, may success always shine upon your steps.",
        "Thank you very much, may all your efforts be blessed and bring fruitful outcomes.",
        "Thank you, may your life be filled with blessings and joy.",
        "Thank you for all the unlimited support, I will always remember your kindness.",
        "Thank you very much, you are an amazing person, may your steps be multiplied with success.",
        "Thank you for all the valuable advice, may your life always be filled with blessings.",
        "Thank you, may success always accompany you in every step you take.",
        "Thank you for all your attention, may you always be blessed in your life.",
        "Thank you for all your kindness, may all your efforts bring happiness and satisfaction.",
        "Thank you for your hard work, may your aspirations be achieved gloriously.",
        "Thank you, may all your dreams come true perfectly.",
        "Thank you for all the valuable advice, may your life be filled with happiness and success.",
        "Thank you very much, may every step you take bring success.",
        "Thank you for all your support and trust, I will always cherish them.",
        "Thank you, may all your endeavors be blessed and bear sweet fruits.",
        "Thank you for your hard work, may success always accompany your steps.",
        "Thank you very much, may all your efforts be blessed and yield magnificent results.",
        "Thank you, may your life be filled with blessings and joy.",
        "Thank you for all your attention and support, I will always cherish them.",
        "Thank you very much, may all your hopes and dreams come true.",
        "Thank you for all the help and cooperation, may success always accompany you.",
        "Thank you, may all the goodness you've given return to you manifold.",
        "Thank you for all your hard work, may success always be with you.",
        "Thank you very much, may all your efforts be blessed and bring fruitful results.",
        "Thank you for the information, it's very helpful.",
        "Thank you for your patience and kindness.",
        "Thank you, may your blessings multiply.",
        "Thank you for the good collaboration.",
        "Thank you very much, may all your dreams come true.",
        "Thank you for all the valuable advice and suggestions.",
        "Thank you, you are an excellent worker.",
        "Thank you for the opportunity to talk.",
        "Thank you very much, hope we can collaborate again in the future.",
        "Thank you for your dedication.",
        "Thank you, may success always be with you in everything you do.",
        "Thank you for your kindness and professionalism.",
        "Thank you very much, you are a valuable asset to the company.",
        "Thank you for all the information you've shared, it's very valuable.",
        "Thank you, may all your efforts be blessed and bring great happiness.",
        "Thank you for all your support.",
        "Thank you very much, you are a kind-hearted person.",
        "Thank you for all the valuable advice.",
        "Thank you, may success always accompany you.",
        "Thank you for your precious time.",
        "Thank you very much, hope we can meet again and chat more.",
        "Thank you for all your guidance, may I become better thanks to you.",
        "Thank you, may all your efforts be blessed and bring magnificent results.",
        "Thank you for your hard work, may success always shine upon your steps.",
        "Thank you very much, may all your efforts be blessed and bring fruitful outcomes.",
        "Thank you, may your life be filled with blessings and joy.",
        "Thank you for all the unlimited support, I will always remember your kindness.",
        "Thank you very much, you are an amazing person, may your steps be multiplied with success.",
        "Thank you for all the valuable advice, may your life always be filled with blessings.",
        "Thank you, may success always accompany you in every step you take.",
        "Thank you for all your attention, may you always be blessed in your life.",
        "Thank you for all your kindness, may all your efforts bring happiness and satisfaction.",
        "Thank you for your hard work, may your aspirations be achieved gloriously.",
        "Thank you, may all your dreams come true perfectly.",
        "Thank you for all the valuable advice, may your life be filled with happiness and success.",
        "Thank you very much, may every step you take bring success.",
        "Thank you for all your support and trust, I will always cherish them.",
        "Thank you, may all your endeavors be blessed and bear sweet fruits.",
        "Thank you for your hard work, may success always accompany your steps.",
        "Thank you very much, may all your efforts be blessed and yield magnificent results.",
        "Thank you, may your life be filled with blessings and joy.",
        "Thank you for all your attention and support, I will always cherish them.",
        "Thank you very much, may all your hopes and dreams come true.",
        "Thank you for all the help and cooperation, may success always accompany you.",
        "Thank you, may all the goodness you've given return to you manifold.",
        "Thank you for all your hard work, may success always be with you.",
        "Thanks for your help, bye",
        "Cheers for the info, man",
        "Got it, thanks",
        "Alright, thanks a lot",
        "Much appreciated, bye",
        "Appreciate it, bye",
        "Goodbye for now",
        "See you later",
        "Have a great day",
        "Okay, bye",
        "Thanks for the help.",
        "Appreciate it.",
        "Goodbye for now.",
        "See you later.",
        "Have a great day.",
        "Thanks for the info.",
        "Really appreciate it.",
        "Thanks a lot.",
        "Thanks for your assistance.",
        "Thanks, man.",
        "Thanks for your cooperation.",
        "Thanks for your time.",
        "Thanks for the advice.",
        "Thanks for the feedback.",
        "Thanks for your support.",
        "Thanks for looking out for me.",
        "Thanks for your collaboration.",
        "Thanks again.",
        "Good deal, thank you.",
        "Much obliged.",
        "Farewell for now.",
        "Catch you later.",
        "Wish you a pleasant day.",
        "Alright, take care.",
        "Thanks for the details.",
        "Thanks for the update.",
        "Thanks for sharing the information.",
        "Cheers for the assistance.",
        "Got it, thanks.",
        "Much appreciated.",
        "Appreciate it, farewell.",
        "Okay, bye bye.",
        "Thanks for the information, bye.",
        "Thanks for your help, bye bye.",
        "Thanks, bye.",
        "Thanks for your time, bye.",
        "Thanks for your dedication, bye.",
        "Thanks for your devotion, bye.",
        "Thanks for your willingness, bye.",
        "Thanks for your readiness, bye.",
        "Thanks for your commitment, bye.",
        "Thanks for your professionalism, bye.",
        "Thanks for your earnestness, bye.",
        "Thank you once more for the information, bye.",
        "Good deal, thank you bye.",
        "Okay, thanks again, bye.",
        "Much obliged, goodbye.",
        "Farewell for now, bye.",
        "Catch you later, bye.",
        "Alright, take care, bye.",
        "Thank you for sharing the information, bye."
      ],
      "responses": [
        "If you have any other questions, feel free to reach out to me again.",
        "If there's anything else you need help with, just let me know.",
        "If you need any further assistance, don't hesitate to contact me again."
      ]
    },
    {
      "tag": "contact_cs",
      "patterns": [
        "How can I reach customer service via phone call?",
        "Can I get assistance by calling customer service?",
        "What is the customer service hotline?",
        "Is there a toll-free number for customer service?",
        "How can I get support over the phone from customer service?",
        "I'm having an issue, how do I contact customer service?",
        "Is there a specific department I can contact for help?",
        "What is the email address to reach customer service?",
        "How do I send an email to customer service?",
        "Is there a dedicated email for complaints?",
        "What is the response time for customer service emails?",
        "Can I expect a quick response from customer service?",
        "How can I contact customer service on Twitter?",
        "Is there a Twitter account for customer support?",
        "What is the customer service handle on Twitter?",
        "Can I get assistance from customer service on Facebook?",
        "Is there a Facebook page for customer support?",
        "What is the customer service page on Facebook?",
        "How do I reach customer service through live chat?",
        "Is live chat available for customer support?",
        "What are the live chat hours for customer service?",
        "Can I get instant help through live chat?",
        "How can I file a complaint with customer service?",
        "Is there a dedicated complaint form for customer service?",
        "What is the procedure for escalating complaints?",
        "How can I request a call back from customer service?",
        "Is there an option for customer service to call me?",
        "What are the operating hours for customer service?",
        "Is customer service available on weekends?",
        "Can I get assistance in a language other than English?",
        "How do I change the language for customer service?",
        "Is there a chatbot for basic customer service inquiries?",
        "How can I get help from a customer service agent?",
        "What information do I need when contacting customer service?",
        "Is there a customer service app I can use?",
        "What is the support email for urgent matters?",
        "Is there a separate line for priority customer service?",
        "How can I get in touch with customer service during holidays?",
        "Can I get assistance from customer service through SMS?",
        "Is there a text messaging service for customer support?",
        "How can I reach customer service through WhatsApp?",
        "Is there a WhatsApp number for customer support?",
        "What are the steps to connect with customer service on WhatsApp?",
        "How can I contact customer service through the website?",
        "Is there a contact form on the website for customer support?",
        "Can I get help through the customer service community forum?",
        "What is the link to the customer service forum?",
        "Is there a self-service help center available?",
        "How can I find customer service on the mobile app?",
        "Is there an in-app chat feature for customer support?",
        "What are the options for reaching customer service internationally?",
        "How can I contact customer service from outside my country?",
        "Is there a customer service number for travelers?",
        "How can I contact customer service?",
        "Is there an email address for customer service?",
        "Is there a phone number for customer service?",
        "Is there a social media account for customer service?",
        "How can I contact customer service over the phone?",
        "How can I contact customer service via email?",
        "How can I contact customer service through social media?",
        "How can I file a complaint with customer service?",
        "Is there a live chat option available with customer service?",
        "How can I submit a question to customer service?",
        "Is customer service available in English?",
        "Is there 24-hour assistance from customer service?",
        "How can I get help from customer service?",
        "Can customer service be reached through WhatsApp?",
        "Is there an emergency contact for customer service?",
        "How can I access customer service assistance?",
        "Can customer service be reached through other social media platforms?",
        "Is there a feature to message customer service?",
        "Is there an emergency contact for urgent issues that need to be handled by customer service?",
        "How can I send an email to customer service?",
        "Is there an emergency phone service for urgent issues that need to be handled by customer service?",
        "Is there video call assistance from customer service?",
        "Is there phone conference assistance from customer service?",
        "How can I send a message through social media to customer service?",
        "Is there an app-based assistance from customer service?",
        "Where can I contact customer service?",
        "What is the method for contacting customer service?",
        "How do I contact customer service?",
        "How do I contact Costumer Service?",
        "Is there a phone number for Costumer Service?",
        "Can I ask for customer service's phone number?",
        "Can I ask for Costumer Service's phone number?",
        "I want to ask for customer service's phone number?",
        "I want to ask for Costumer Service's phone number?",
        "I want to request customer service's phone number?",
        "I want to request Costumer Service's phone number?",
        "May I ask for customer service's phone number?",
        "May I ask for Costumer Service's phone number?",
        "How can I contact Costumer Service over the phone?",
        "Is there an email address for Costumer Service?",
        "How can I contact Costumer Service via email?",
        "Is there a live chat feature for CS?",
        "Is there a live chat feature for Costumer Service?",
        "How can I contact CS through live chat?",
        "How can I contact Costumer Service through live chat?",
        "Where do I contact CS?",
        "Where do I contact customer service now?",
        "Where I can contact customer service?",
        "How to contact customer service?",
        "How to reach out customer service?",
        "How to reach out to customer service?",
        "How to contact CS?",
        "How to reach out CS?",
        "How to reach out to CS?",
        "How to get a hold of customer service?",
        "How to get a hold of CS?",
        "How to reach customer service?",
        "How to reach CS?",
        "How can I get in touch with customer service?",
        "If I want to contact Customer Service directly, where should I go?",
        "If I want to contact CS directly, where should I go?",
        "How can I contact Customer Service?",
        "How can I contact CS?",
        "How can I reach Customer Service?",
        "How can I reach CS?",
        "Can I get the contact information for Customer Service?",
        "Can I get the contact information for CS?",
        "May I have the contact information for Customer Service?",
        "May I have the contact information for CS?",
        "How can I contact CS?",
        "What is the email address for CS?",
        "What is the phone number for CS?",
        "What are the social media accounts for CS?",
        "How do I contact CS by phone?",
        "How do I contact CS by email?",
        "Is there an emergency contact for CS?",
        "How do I access support services from CS?",
        "Can CS be contacted through other social media platforms?",
        "Is there a feature to send messages to CS?",
        "Where can I contact CS?",
        "How to contact CS?",
        "How to contact Customer Service?",
        "Is there a phone number for CS?",
        "Is there a phone number for Customer Service?",
        "Can I get a phone number for CS?",
        "Is there a live chat feature for CS?",
        "Is there a live chat feature for Customer Service?",
        "How to contact CS through live chat?",
        "How to contact Customer Service through live chat?",
        "Where should I contact CS?",
        "Where can I contact CS now?",
        "If I need to contact Customer Service, where should I contact?",
        "I want to contact CS, please tell me how.",
        "What is the best way to contact Customer Service?",
        "Is there an easy way to contact CS?",
        "I need to contact Customer Service, any suggestions?",
        "Are there any phone numbers or email addresses for Customer Service?",
        "I need contact information for Customer Service, can you help?",
        "Please provide contact information for Customer Service, thank you.",
        "I would like to request the phone number of Customer Service, can you help?",
        "Is there a direct communication channel with Customer Service?",
        "How can I contact Customer Service directly?",
        "Are there any customer service lines I can call?",
        "I want to know how to contact Customer Service through social media.",
        "What is the fastest way to contact Customer Service by phone?",
        "Is there a Customer Service email I can contact?",
        "Is there an emergency number to contact Customer Service?",
        "How can I access help from Customer Service?",
        "Are there other options to contact Customer Service through social media?",
        "I want to know if there is a direct message feature to contact Customer Service?",
        "Where can I contact Customer Service?",
        "How to contact Customer Service?",
        "How to contact Costumer Service?",
        "Is there a phone number for Customer Service?",
        "Is there a live chat feature for Customer Service?",
        "How to contact Customer Service through live chat?",
        "Where should I contact Customer Service?",
        "Where can I contact Customer Service now?",
        "If I need to contact Customer Service, where should I contact?",
        "I want to contact Customer Service, please tell me how.",
        "What is the best way to contact Customer Service?",
        "Is there an easy way to contact Customer Service?",
        "I need to contact Customer Service, any suggestions?",
        "Are there any phone numbers or email addresses for Customer Service?",
        "I need contact information for Customer Service, can you help?",
        "Please provide contact information for Customer Service, thank you.",
        "I would like to request the phone number of Customer Service, can you help?",
        "Is there a direct communication channel with Customer Service?",
        "How can I contact Customer Service directly?",
        "Are there any customer service lines I can call?",
        "I want to know how to contact Customer Service through social media.",
        "What is the fastest way to contact Customer Service by phone?",
        "Is there a Customer Service email I can contact?",
        "Is there an emergency number to contact Customer Service?",
        "How can I access help from Customer Service?",
        "Are there other options to contact Customer Service through social media?",
        "I want to know if there is a direct message feature to contact Customer Service?",
        "Where can I contact Customer Service?",
        "How to contact Customer Service?",
        "How to contact Costumer Service?",
        "Is there a phone number for Customer Service?",
        "Is there a live chat feature for Customer Service?",
        "How to contact Customer Service through live chat?",
        "Where should I contact Customer Service?",
        "Where can I contact Customer Service now?",
        "If I need to contact Customer Service, where should I contact?",
        "I want to contact Customer Service, please tell me how.",
        "What is the best way to contact Customer Service?",
        "Is there an easy way to contact Customer Service?",
        "I need to contact Customer Service, any suggestions?",
        "Are there any phone numbers or email addresses for Customer Service?",
        "I need contact information for Customer Service, can you help?",
        "Please provide contact information for Customer Service, thank you.",
        "I would like to request the phone number of Customer Service, can you help?",
        "Is there a direct communication channel with Customer Service?",
        "How can I contact Customer Service directly?",
        "Are there any customer service lines I can call?",
        "I want to know how to contact Customer Service through social media.",
        "What is the fastest way to contact Customer Service by phone?",
        "Is there a Customer Service email I can contact?",
        "Is there an emergency number to contact Customer Service?",
        "How can I access help from Customer Service?",
        "Are there other options to contact Customer Service through social media?",
        "I want to know if there is a direct message feature to contact Customer Service?",
        "Where can I contact Customer Service?",
        "How to contact Customer Service?",
        "How to contact Costumer Service?",
        "Is there a phone number for Customer Service?",
        "Is there a live chat feature for Customer Service?",
        "How to contact Customer Service through live chat?",
        "I need information on how to contact the Customer Service Team, can you explain?",
        "Are there options to send direct messages to the Customer Service Team?",
        "How can I contact Customer Service if I have issues with my order?",
        "I want to know if there is a contact form I can fill out to reach the Customer Service Team?",
        "Is there a live chat feature with the Customer Service Team?",
        "What is the fastest way to get a response from the Customer Service Team?",
        "Are there specific applications for contacting Customer Service?",
        "How can I contact Customer Service outside of business hours?",
        "I want to know if there is an online help center I can access?",
        "Is there a WhatsApp number I can contact to reach the Customer Service Team?",
        "How can I contact Customer Service in English?",
        "Are there options to submit inquiries through a contact form on the website?",
        "I need information on how to contact Customer Service through the mobile app.",
        "Is there an online community forum where I can seek help from fellow customers?",
        "How can I contact the Customer Service Team if I have a complaint?",
        "Is there an emergency number to contact in urgent situations?",
        "How can I contact Customer Service to cancel my order?",
        "I want to know if there is an option to contact Customer Service through video chat."
      ],
      "responses": [
        "Hey  , you can reach out to this number, 08XXXXXXXX",
        "You can contact this number directly, 08XXXXXXXX  ",
        "Here's our customer service number  , 08XXXXXXXX"
      ]
    },
    {
      "tag": "media_social",
      "patterns": [
        "What is the Instagram account for M Coffee Company?",
        "Can you provide me with the M Coffee Company Instagram handle?",
        "I'd like to follow M Coffee Company on Instagram.",
        "Where can I find M Coffee Company on Instagram?",
        "Is M Coffee Company on Instagram?",
        "Please give me the link to M Coffee Company's Instagram account.",
        "How do I access M Coffee Company's Instagram profile?",
        "What's the username for M Coffee Company's Instagram?",
        "Can I get the link to M Coffee Company's Instagram page?",
        "Tell me about M Coffee Company's Instagram presence.",
        "Does M Coffee Company have an official Instagram account?",
        "What's the name of M Coffee Company's Instagram account?",
        "Is there an official Instagram account for M Coffee Company?",
        "Can you provide the Instagram username for M Coffee Company?",
        "How do I find M Coffee Company on Instagram?",
        "What's the handle for M Coffee Company's Instagram?",
        "Has M Coffee Company set up an Instagram account yet?",
        "How can I follow M Coffee Company on Instagram?",
        "Can I check out M Coffee Company's Instagram profile?",
        "Is M Coffee Company on social media?",
        "Please give me the M Coffee Company Instagram handle.",
        "What's the Instagram username for M Coffee Company?",
        "Is there a verified Instagram account for M Coffee Company?",
        "Can you get me the M Coffee Company Instagram account details?",
        "I want to connect with M Coffee Company on Instagram.",
        "Tell me if M Coffee Company is on Instagram.",
        "What's the official Instagram account for M Coffee Company?",
        "Can you give me more information about M Coffee Company's Instagram presence?",
        "How can I access M Coffee Company's Instagram account?",
        "Is M Coffee Company active on Instagram?",
        "Where can I find M Coffee Company's Instagram page?",
        "Does M Coffee Company have a presence on Instagram?",
        "What's the link to M Coffee Company's Instagram account?",
        "Is M Coffee Company on Instagram?",
        "Please tell me about M Coffee Company's Instagram account.",
        "What's the Instagram page for M Coffee Company?",
        "Can I follow M Coffee Company on Instagram?",
        "Tell me the Instagram handle for M Coffee Company.",
        "Does M Coffee Company have an Instagram account?",
        "Is there an Instagram account for M Coffee Company?",
        "Can I ask for the M Coffee Company Instagram account?",
        "What is the name of the M Coffee Company Instagram account?",
        "Has M Coffee Company set up an Instagram account yet?",
        "Can you get the username for the M Coffee Company Instagram account?",
        "Has the M Coffee Company Instagram account been followed yet?",
        "Can you provide the link to the M Coffee Company Instagram account?",
        "Are there any updates on the M Coffee Company Instagram account?",
        "Can you give me more information about the M Coffee Company Instagram account?",
        "How can I access the M Coffee Company Instagram account?",
        "Can you tell me when the M Coffee Company Instagram account was created?",
        "Is there a way to contact the M Coffee Company Instagram account?",
        "Are there any promotions currently on the M Coffee Company Instagram account?",
        "What's the latest post on M Coffee Company's Instagram?",
        "Can you show me M Coffee Company's Instagram feed?",
        "Is there a story on M Coffee Company's Instagram?",
        "Tell me about the content on M Coffee Company's Instagram.",
        "What type of posts does M Coffee Company share on Instagram?",
        "Can you find M Coffee Company's Instagram account?",
        "Is M Coffee Company active on Instagram?",
        "What's the engagement like on M Coffee Company's Instagram?",
        "How often does M Coffee Company post on Instagram?",
        "Are there any Instagram highlights for M Coffee Company?",
        "What's the follower count on M Coffee Company's Instagram?",
        "Is M Coffee Company hosting any Instagram giveaways?",
        "How can I interact with M Coffee Company on Instagram?",
        "What's the most popular post on M Coffee Company's Instagram?",
        "Does M Coffee Company use Instagram for customer support?",
        "Are there any Instagram-exclusive offers from M Coffee Company?",
        "Can you check M Coffee Company's Instagram stories?",
        "Tell me if M Coffee Company uses Instagram for promotions.",
        "What's the hashtag used by M Coffee Company on Instagram?",
        "Can I find M Coffee Company's menu on Instagram?",
        "Is there an Instagram shop for M Coffee Company?",
        "Tell me about the bio on M Coffee Company's Instagram.",
        "What are the Instagram highlights on M Coffee Company's profile?",
        "Can I get customer reviews on M Coffee Company's Instagram?",
        "Tell me about M Coffee Company's Instagram aesthetic.",
        "What's the posting schedule for M Coffee Company's Instagram?",
        "Is M Coffee Company collaborating with influencers on Instagram?",
        "Can I find behind-the-scenes content on M Coffee Company's Instagram?",
        "Tell me about M Coffee Company's Instagram engagement strategies.",
        "What's the IGTV content like on M Coffee Company's Instagram?",
        "Is there a link to M Coffee Company's website on Instagram?",
        "Can I find the address or location of M Coffee Company on Instagram?",
        "What's the response time of M Coffee Company on Instagram?",
        "Tell me about the brand partnerships on M Coffee Company's Instagram.",
        "Does M Coffee Company run any Instagram ads?",
        "Is M Coffee Company hosting any Instagram events?",
        "What's the Instagram Story highlight for promotions?",
        "Can I get a virtual tour of M Coffee Company on Instagram?",
        "Tell me about the photo captions on M Coffee Company's Instagram.",
        "What's the follower growth rate for M Coffee Company on Instagram?",
        "Is there a link to M Coffee Company's loyalty program on Instagram?",
        "Can you show me M Coffee Company's Instagram analytics?",
        "Tell me about the Instagram Stories strategy of M Coffee Company.",
        "What's the most liked post on M Coffee Company's Instagram?",
        "Does M Coffee Company collaborate with local artists on Instagram?",
        "Is there an Instagram feature for ordering from M Coffee Company?",
        "Can I get nutritional information on M Coffee Company's Instagram?",
        "Tell me about the social causes promoted on M Coffee Company's Instagram.",
        "What's the IGTV series on M Coffee Company's Instagram?",
        "Does M Coffee Company use Instagram for recruitment?",
        "Is there a hashtag campaign run by M Coffee Company on Instagram?",
        "Can you find M Coffee Company's Instagram IGTV episodes?",
        "Tell me about the giveaways hosted by M Coffee Company on Instagram.",
        "What's the social media contest strategy of M Coffee Company?",
        "Is there an Instagram Stories takeover by M Coffee Company?",
        "Can I get an Instagram shoutout from M Coffee Company?",
        "Tell me about the user-generated content shared by M Coffee Company on Instagram.",
        "What's the brand voice portrayed on M Coffee Company's Instagram?",
        "Does M Coffee Company collaborate with other coffee brands on Instagram?",
        "Is there an Instagram challenge hosted by M Coffee Company?",
        "Can you show me the Instagram highlight for customer reviews?",
        "Tell me about the coffee-related tips shared by M Coffee Company on Instagram.",
        "What's the Instagram Live schedule for M Coffee Company?",
        "Does M Coffee Company use Instagram for sustainability initiatives?",
        "Is there an Instagram influencer partnership by M Coffee Company?",
        "Can I find M Coffee Company's limited edition products on Instagram?",
        "Tell me about the photography style on M Coffee Company's Instagram.",
        "What's the rating of M Coffee Company on Instagram?",
        "Does M Coffee Company collaborate with local communities on Instagram?",
        "Is there an Instagram campaign for seasonal promotions by M Coffee Company?",
        "Can you find the Instagram Stories ads of M Coffee Company?",
        "Tell me about the customer testimonials shared on M Coffee Company's Instagram.",
        "What's the IGTV series for barista tips on M Coffee Company's Instagram?",
        "Does M Coffee Company use Instagram for charity initiatives?",
        "Is there an Instagram Reels strategy by M Coffee Company?",
        "Can I find M Coffee Company's merchandise on Instagram?",
        "Tell me about the coffee-related quotes shared by M Coffee Company on Instagram.",
        "Is the M Coffee Company Instagram account available?",
        "Can you share the M Coffee Company Instagram account?",
        "What is the username for the M Coffee Company Instagram account?",
        "Does M Coffee Company have an Instagram account?",
        "Can you provide the username for the M Coffee Company Instagram account?",
        "Where can the M Coffee Company Instagram account be found?",
        "Can you tell me the M Coffee Company Instagram account?",
        "Have you already followed the M Coffee Company Instagram account?",
        "Does M Coffee Company have any other social media accounts?",
        "Is the link to the M Coffee Company Instagram account available?",
        "Can you follow the M Coffee Company Instagram account now?",
        "Is there an official M Coffee Company Instagram account?",
        "Where can the official M Coffee Company Instagram account be found?",
        "Where can the official M Coffee Company Instagram account be accessed?",
        "Is M Coffee Company on the official Instagram account?",
        "Can you get the name of the official M Coffee Company Instagram account?",
        "Does M Coffee Company have an official Instagram account?",
        "What is the username for the official M Coffee Company Instagram account?",
        "Can you follow the official M Coffee Company Instagram account?",
        "Is there a specific way to follow the official M Coffee Company Instagram account?",
        "Where can the M Coffee Company Instagram account be followed?",
        "Where can the M Coffee Company Instagram account be located?",
        "Can you get the name of the M Coffee Company Instagram account?",
        "Can the M Coffee Company Instagram account be followed now?",
        "Does M Coffee Company have any other social media accounts besides Instagram?",
        "Can the M Coffee Company Instagram account be followed via a link?",
        "Has the M Coffee Company Instagram account been followed or not?",
        "Is there a way to register for the M Coffee Company Instagram account?",
        "Can the M Coffee Company Instagram account be followed in a certain way?",
        "Can the M Coffee Company Instagram account be followed through an app?",
        "Can the M Coffee Company Instagram account be followed through a website?",
        "Can the M Coffee Company Instagram account be followed by searching its name?",
        "Can the M Coffee Company Instagram account be followed by knowing its username?",
        "Does M Coffee Company have an active Instagram account?",
        "Can the M Coffee Company Instagram account be followed by searching its username?",
        "Can the M Coffee Company Instagram account be followed by knowing its name?",
        "Is there an M Coffee Company Instagram account?",
        "Can I ask for the M Coffee Company Instagram account?",
        "What is the name of the M Coffee Company Instagram account?",
        "Has M Coffee Company set up an Instagram account yet?",
        "Can you get the username for the M Coffee Company Instagram account?",
        "Has the M Coffee Company Instagram account been followed yet?",
        "Can you provide the link to the M Coffee Company Instagram account?",
        "Are there any updates on the M Coffee Company Instagram account?",
        "Can you give me more information about the M Coffee Company Instagram account?",
        "How can I access the M Coffee Company Instagram account?",
        "Can you tell me when the M Coffee Company Instagram account was created?",
        "Is there a way to contact the M Coffee Company Instagram account?",
        "Are there any promotions currently on the M Coffee Company Instagram account?",
        "Do you have an Instagram account?",
        "What's your Instagram account?",
        "Can I have your Instagram?",
        "What's your Instagram?",
        "Does this coffeeshop use Instagram Guides to provide the best coffee recommendations?",
        "Does this coffeeshop frequently upload videos about latte art techniques on TikTok?",
        "Does this coffeeshop hold live music events on YouTube?",
        "I want to see customer testimonials about the coffee quality from this coffeeshop on Instagram.",
        "Does M Coffee Company use Facebook Groups for coffee fan communities?",
        "Does M Coffee Company frequently hold baking classes with baristas on Instagram?",
        "Can I see videos of specialty drinks being made by M Coffee Company on TikTok?",
        "Does M Coffee Company hold live streaming cupping sessions on YouTube?",
        "Does M Coffee Company frequently upload videos about coffee brewing tips on Twitter?",
        "Does M Coffee Company use Instagram Reels to upload short and funny coffee content?",
        "I want to see interesting coffee photos from M Coffee Company on Facebook.",
        "Does M Coffee Company frequently offer special promotions to its Instagram followers?",
        "Does M Coffee Company use Twitter Spaces for coffee-related Q&A sessions?",
        "Does M Coffee Company have a YouTube channel featuring local coffee farmers?",
        "Can I see interesting photos of the coffee-making process from M Coffee Company on Instagram?",
        "Does M Coffee Company frequently hold live cooking events on YouTube?",
        "Does M Coffee Company frequently upload videos about coffee roasting processes on TikTok?",
        "Does this coffeeshop use Twitter Fleets to share unique coffee moments?",
        "I want to see videos about pour-over coffee techniques from this coffeeshop on Facebook.",
        "Does this coffeeshop frequently interact with its followers through Instagram Direct Message?",
        "Does this coffeeshop hold live talk shows on YouTube?",
        "Can I see videos of fresh drink tutorials from this coffeeshop's baristas on TikTok?",
        "Does this coffeeshop use Twitter Lists to categorize interesting coffee content?",
        "Does this coffeeshop frequently upload espresso shot tutorial videos on Instagram?",
        "I want to see interesting photos of the coffee-making process from this coffeeshop on Facebook.",
        "Does this coffeeshop hold live streaming cupping sessions on YouTube?",
        "Does this coffeeshop frequently upload videos about the health benefits of coffee on TikTok?",
        "Can you share the Instagram account?",
        "Does M Coffee Company have an Instagram account?",
        "Can I get the Instagram username?",
        "Where can I find the Instagram account?",
        "Does M Coffee Company have any other social media accounts?",
        "What's the Instagram username?",
        "What's the Instagram account name?",
        "Is there an Instagram account for the coffeeshop?",
        "Does this coffeeshop use Twitter Threads to share interesting coffee stories?",
        "I want to see unique photos of coffee from this coffeeshop on Instagram.",
        "Does this coffeeshop frequently hold exclusive merchandise giveaways on Facebook?",
        "Does this coffeeshop hold live cooking classes on YouTube?",
        "Can I see videos of specialty drink making from this coffeeshop on TikTok?",
        "Does this coffeeshop frequently upload interesting coffee photos on Facebook?",
        "Does this coffeeshop use Instagram Guides to provide the best coffee recommendations?",
        "Does this coffeeshop hold live streaming pour-over coffee events on YouTube?",
        "I want to see customer testimonials about the coffee quality from this coffeeshop on Instagram.",
        "Does this coffeeshop use Facebook Groups for coffee fan communities?",
        "Does this coffeeshop frequently hold baking classes with baristas on YouTube?",
        "Can I see videos of specialty drink making from this coffeeshop on TikTok?",
        "Does this coffeeshop hold live streaming cupping sessions on Facebook?",
        "Can you share the official Instagram account?",
        "Does this coffeeshop have an Instagram account that can be followed?",
        "Do you have an Instagram account?",
        "What's the official Instagram username?",
        "Can I follow the Instagram account?",
        "Can you share the Instagram account?",
        "Does this coffeeshop have an active Instagram account?",
        "Where can I find the Instagram account?",
        "Can I get their Instagram account?",
        "What's the latest Instagram username?",
        "Is there an Instagram account? I want to follow.",
        "Does this coffeeshop have a popular Instagram account?",
        "Can you share the official Instagram username?",
        "Can I get information about their Instagram account?",
        "Is this coffeeshop active on Instagram?",
        "What's the official Instagram account name?",
        "Is there a recent update from their Instagram account?",
        "Is their Instagram account cool?",
        "Do they have a verified Instagram account?",
        "Can I get the official Instagram username?",
        "Can I follow their Instagram account?",
        "Is there any interesting content on their Instagram?",
        "Can you recommend similar Instagram accounts to me?",
        "What's the frequently updated Instagram account name?",
        "Are there any interesting giveaways on their Instagram account?",
        "Do they have a lot of followers on their Instagram?",
        "Can I get the verified Instagram username?",
        "Are they actively promoting on Instagram?",
        "Do they have a Facebook account?",
        "Can I get the link to their Facebook?",
        "What's the Facebook account name?",
        "Do they have a Twitter account?",
        "Can I get their Twitter username?",
        "Do they have a Twitter account?",
        "Are they active on TikTok?",
        "Can I get their TikTok username?",
        "Do they have a TikTok account?",
        "Do they have a LinkedIn account?",
        "Can I get the link to their LinkedIn?",
        "What's their LinkedIn account name?",
        "Do they have a Snapchat account?",
        "Can I get their Snapchat username?",
        "Do they have a Snapchat account?",
        "Do they have a Pinterest account?",
        "Can I get their Pinterest username?",
        "Do they have a Pinterest account?",
        "Do they have a YouTube channel?",
        "Can I get the link to their YouTube channel?",
        "What's their YouTube channel name?",
        "Do they have an Instagram TV (IGTV) account?",
        "Can I get the link to their IGTV?",
        "Do they have a Google+ account?",
        "Can I get their Google+ username?",
        "Do they have a Google+ account?",
        "Do they have a Vimeo account?",
        "Can I get their Vimeo username?",
        "Do they have a Vimeo account?",
        "Are they active on Reddit?",
        "Can I get their Reddit username?",
        "Do they have a Reddit account?",
        "Are they on Instagram Stories?",
        "Can I get their Instagram Stories username?",
        "Do they have an Instagram Stories account?",
        "Are they on WeChat?",
        "Can I get their WeChat username?",
        "Do they have a WeChat account?",
        "Do they have a Line account?",
        "Can I get their Line username?"
      ],
      "responses": [
        "Just follow us on @mcoffeecompany, okay :)",
        "You can follow our Instagram account @mcoffeecompany, go ahead :)",
        "Don't forget to follow @mcoffeecompany on Instagram, okay :)"
      ]
    },
    {
      "tag": "jam_oprasional",
      "patterns": [
        "What time does M Company Coffee open?",
        "When does M Company Coffee open?",
        "When does M Company Coffee close for the day?",
        "What time does M Company Coffee start serving?",
        "What time does M Company Coffee stop serving?",
        "When does M Company Coffee start business?",
        "When does M Company Coffee end business?",
        "Can you tell me the hours of operation for M Company Coffee?",
        "When does M Company Coffee usually open its doors?",
        "When does M Company Coffee usually close?",
        "What time can I visit M Company Coffee?",
        "What time does M Company Coffee begin operations in the morning?",
        "What time does M Company Coffee stop serving in the evening?",
        "Can you provide the opening hours for M Company Coffee?",
        "Can you provide the closing hours for M Company Coffee?",
        "When is M Company Coffee available for customers?",
        "Is M Company Coffee currently open?",
        "Is M Company Coffee currently closed?",
        "When does M Company Coffee start serving breakfast?",
        "When does M Company Coffee start serving lunch?",
        "When does M Company Coffee start serving dinner?",
        "When does M Company Coffee start serving beverages?",
        "What time does M Company Coffee open on weekdays?",
        "What time does M Company Coffee close on weekdays?",
        "What are the operating hours of M Company Coffee on weekdays?",
        "What are the business hours of M Company Coffee on weekdays?",
        "Is M Company Coffee open on Mondays?",
        "Is M Company Coffee closed on Mondays?",
        "Is M Company Coffee open on Tuesdays?",
        "Is M Company Coffee closed on Tuesdays?",
        "Is M Company Coffee open on Wednesdays?",
        "Is M Company Coffee closed on Wednesdays?",
        "Is M Company Coffee open on Thursdays?",
        "Is M Company Coffee closed on Thursdays?",
        "Is M Company Coffee open on Fridays?",
        "Is M Company Coffee closed on Fridays?",
        "Is M Company Coffee open on Saturdays?",
        "Is M Company Coffee closed on Saturdays?",
        "On weekends, what time does M Company Coffee open?",
        "On weekends, what time does M Company Coffee close?",
        "On weekends, what are the operating hours of M Company Coffee?",
        "On weekends, what are the business hours of M Company Coffee?",
        "Is M Company Coffee open on public holidays?",
        "Is M Company Coffee closed on public holidays?",
        "What time does M Company Coffee open on public holidays?",
        "What time does M Company Coffee close on public holidays?",
        "What are the operating hours of M Company Coffee on public holidays?",
        "What are the business hours of M Company Coffee on public holidays?",
        "Is M Company Coffee open on Christmas Day?",
        "Is M Company Coffee closed on Christmas Day?",
        "Is M Company Coffee open on New Year's Day?",
        "Is M Company Coffee closed on New Year's Day?",
        "Is M Company Coffee open on Thanksgiving Day?",
        "Is M Company Coffee closed on Thanksgiving Day?",
        "On holidays, what time does M Company Coffee close?",
        "On Sundays, what time does M Company Coffee close?",
        "On holidays, what are the operating hours of M Company Coffee?",
        "On Sundays, what are the operating hours of M Company Coffee?",
        "Can you tell me the opening hours of M Company Coffee throughout the week?",
        "Can you tell me the closing hours of M Company Coffee throughout the week?",
        "When does M Company Coffee open on weekdays?",
        "When does M Company Coffee close on weekdays?",
        "What are the opening hours of M Company Coffee on weekdays?",
        "What are the closing hours of M Company Coffee on weekdays?",
        "On what days is M Company Coffee open?",
        "On what days is M Company Coffee closed?",
        "On what days does M Company Coffee operate?",
        "Is M Company Coffee open daily?",
        "Is M Company Coffee closed daily?",
        "Are the operating hours of M Company Coffee the same every day?",
        "Can you tell me the opening hours of M Company Coffee on Sundays?",
        "Can you tell me the closing hours of M Company Coffee on Sundays?",
        "What time does M Company Coffee open on Saturdays?",
        "What time does M Company Coffee close on Saturdays?",
        "What are the operating hours of M Company Coffee on Saturdays?",
        "What are the business hours of M Company Coffee on Saturdays?",
        "Is M Company Coffee open on weekends?",
        "Is M Company Coffee closed on weekends?",
        "When does M Company Coffee open on Sundays?",
        "When does M Company Coffee close on Sundays?",
        "Can you tell me the opening hours of M Company Coffee on holidays?",
        "Can you tell me the closing hours of M Company Coffee on holidays?",
        "What time does M Company Coffee open on Saturdays and Sundays?",
        "What time does M Company Coffee close on Saturdays and Sundays?",
        "What are the operating hours of M Company Coffee on Saturdays and Sundays?",
        "What are the business hours of M Company Coffee on Saturdays and Sundays?",
        "On what days is M Company Coffee open and closed?",
        "Is M Company Coffee open on weekdays and weekends?",
        "Are the operating hours of M Company Coffee different on weekdays and weekends?",
        "Can you tell me the opening hours of M Company Coffee on weekdays and weekends?",
        "Can you tell me the closing hours of M Company Coffee on weekdays and weekends?",
        "When does M Company Coffee start serving breakfast on weekends?",
        "When does M Company Coffee start serving lunch on weekends?",
        "When does M Company Coffee start serving dinner on weekends?",
        "When does M Company Coffee start serving beverages on weekends?",
        "Can you provide the opening hours for M Company Coffee on holidays and weekends?",
        "Can you provide the closing hours for M Company Coffee on holidays and weekends?",
        "On what days is M Company Coffee open and closed during holidays?",
        "Is M Company Coffee open on all public holidays?",
        "Is M Company Coffee closed on all public holidays?",
        "Is M Company Coffee open during Christmas holidays?",
        "Is M Company Coffee closed during Christmas holidays?",
        "Is M Company Coffee open during New Year holidays?",
        "Is M Company Coffee closed during New Year holidays?",
        "Is M Company Coffee open during Thanksgiving holidays?",
        "Is M Company Coffee closed during Thanksgiving holidays?",
        "On holidays, what time does M Company Coffee open and close?",
        "On Sundays, what time does M Company Coffee open and close?",
        "On holidays, what are the operating hours of M Company Coffee?",
        "On Sundays, what are the operating hours of M Company Coffee?",
        "Is M Company Coffee open every day except on Sundays?",
        "Is M Company Coffee closed every day except on Sundays?",
        "Are the operating hours of M Company Coffee every day except on Sundays?",
        "Is M Company Coffee open on weekdays only?",
        "Is M Company Coffee closed on weekdays only?",
        "Are the operating hours of M Company Coffee on weekdays only?",
        "Can you provide the opening hours for M Company Coffee on holidays and Sundays?",
        "Can you provide the closing hours for M Company Coffee on holidays and Sundays?",
        "On what days is M Company Coffee open and closed on holidays and Sundays?",
        "Is M Company Coffee open on Sundays and holidays?",
        "Is M Company Coffee closed on Sundays and holidays?",
        "What time does M Company Coffee open on Sundays and holidays?",
        "What time does M Company Coffee close on Sundays and holidays?",
        "What are the operating hours of M Company Coffee on Sundays and holidays?",
        "What are the business hours of M Company Coffee on Sundays and holidays?",
        "Is M Company Coffee open on weekends and holidays?",
        "Is M Company Coffee closed on weekends and holidays?",
        "When does M Company Coffee open on weekends and holidays?",
        "When does M Company Coffee close on weekends and holidays?",
        "What are the operating hours of M Company Coffee on weekends and holidays?",
        "What are the business hours of M Company Coffee on weekends and holidays?",
        "What time does M Company Coffee close?",
        "What are the operating hours of M Company Coffee?",
        "What are the business hours of M Company Coffee?",
        "What time does M Company Coffee open on holidays?",
        "What time does M Company Coffee close on holidays?",
        "What are the operating hours of M Company Coffee on holidays?",
        "What are the business hours of M Company Coffee on holidays?",
        "Is M Company Coffee open on weekends?",
        "Is M Company Coffee closed on weekends?",
        "Is M Company Coffee still open at the moment?",
        "Is M Company Coffee already closed at the moment?",
        "What time does M Company Coffee open on Sundays?",
        "What time does M Company Coffee close on Sundays?",
        "What are the operating hours of M Company Coffee on Sundays?",
        "What are the business hours of M Company Coffee on Sundays?",
        "Is M Company Coffee still open?",
        "Has M Company Coffee already closed?",
        "Has M Company Coffee already opened?",
        "On holidays, what time does M Company Coffee open?",
        "On Sundays, what time does M Company Coffee open?",
        "Information on operating hours",
        "Info on opening and closing times, what time?",
        "Usually what time does it open?",
        "Usually what time does it close?",
        "What are the opening hours of M Company Coffee throughout the week?",
        "What are the closing hours of M Company Coffee throughout the week?",
        "On what days are the operating hours of M Company Coffee?",
        "On what days is M Company Coffee open?",
        "On what days is M Company Coffee closed?",
        "Is M Company Coffee open every day?",
        "Is M Company Coffee closed every day?",
        "Are the operating hours of M Company Coffee every day?",
        "Can you tell me the opening hours of M Company Coffee?",
        "Can you tell me the closing hours of M Company Coffee?",
        "Can you tell me the operating hours of M Company Coffee?",
        "Is M Company Coffee open every day except for which day?",
        "Is M Company Coffee closed every day except for which day?",
        "Are the operating hours of M Company Coffee every day except for which day?",
        "Is M Company Coffee open only on certain days?",
        "Is M Company Coffee closed only on certain days?",
        "Are the operating hours of M Company Coffee only on certain days?",
        "Is M Company Coffee open on holidays?",
        "On what days is the opening hours of M Company Coffee?",
        "On what days is the closing hours of M Company Coffee?",
        "On what days is the operating hours of M Company Coffee?",
        "What are the opening hours of M Company Coffee at different outlets?",
        "What are the closing hours of M Company Coffee at different outlets?",
        "What are the operating hours of M Company Coffee at different outlets?",
        "What are the opening hours of M Company Coffee on Sundays?",
        "Is there a Bengawan coffee shop nearby?",
        "Where can I find a Bengawan coffee shop?",
        "Is there a Bengawan branch in this area?",
        "Where is the nearest Bengawan coffee shop?",
        "Can you tell me the location of the nearest Bengawan coffee shop?",
        "Where can I find the closest Bengawan coffee shop?",
        "Is there a Bengawan branch in this city?",
        "Is there a Bengawan coffee shop in this area?",
        "Can you provide the location of the Bengawan coffee shop?",
        "Where is the Bengawan coffee shop located?",
        "Is there a Bengawan branch nearby?",
        "Where can I find a Bengawan branch?",
        "Is there a Bengawan coffee shop in this city?",
        "Where can I find a Bengawan branch in this area?",
        "Where can I find the nearest Bengawan branch?",
        "Is there a Bengawan coffee shop in this country?",
        "Can you tell me the location of the nearest Bengawan branch?",
        "Where is the closest Bengawan branch?",
        "Is there a Bengawan branch in this province?",
        "Where can I find the closest Bengawan branch in this city?",
        "Is there a Bengawan branch in this country?",
        "Where can I find the nearest Bengawan coffee shop in this area?",
        "Where can I find the nearest Bengawan coffee shop in this city?",
        "Is there a Bengawan coffee shop near me?",
        "Where can I find a Bengawan branch near me?",
        "Is there a Bengawan coffee shop in this province?",
        "Where can I find the nearest Bengawan coffee shop in this country?",
        "Where can I find the nearest Bengawan branch in this province?",
        "Is there a Bengawan coffee shop in the vicinity?",
        "Where can I find the nearest Bengawan coffee shop in this country?",
        "Where can I find the closest Bengawan coffee shop in this area?",
        "Where can I find the closest Bengawan coffee shop in this city?",
        "Is there a Bengawan branch in my neighborhood?",
        "Where can I find a Bengawan coffee shop around here?",
        "Is there a Bengawan coffee shop in this neighborhood?",
        "Where can I find a Bengawan branch in this city?",
        "Is there a Bengawan coffee shop in this district?",
        "Where can I find a Bengawan branch in this district?",
        "Is there a Bengawan coffee shop in this town?",
        "Where can I find the nearest Bengawan coffee shop in this district?",
        "Where can I find the nearest Bengawan branch in this district?",
        "Is there a Bengawan coffee shop in this town?",
        "Where can I find the closest Bengawan coffee shop in this district?",
        "Where can I find the closest Bengawan branch in this district?",
        "Is there a Bengawan coffee shop in this region?",
        "Where can I find a Bengawan branch in this region?",
        "Is there a Bengawan coffee shop in this part of the city?",
        "Where can I find the nearest Bengawan coffee shop in this region?",
        "Where can I find the nearest Bengawan branch in this region?",
        "Is there a Bengawan coffee shop in this part of town?",
        "Where can I find the closest Bengawan coffee shop in this region?",
        "Where can I find the closest Bengawan branch in this region?",
        "Is there a Bengawan Coffee Company branch nearby?",
        "Can you tell me if there's a Bengawan Coffee Company branch around here?",
        "Where can I find a Bengawan Coffee Company branch in this area?",
        "Is there a Bengawan Coffee Company branch in this city?",
        "Can you give me information about the nearest Bengawan Coffee Company branch?",
        "Are there any Bengawan Coffee Company branches in this city?",
        "Can you tell me where to find a Bengawan Coffee Company branch?",
        "Is there a Bengawan Coffee Company branch in this province?",
        "Can you give me information about Bengawan Coffee Company branches in this country?",
        "Where can I find a Bengawan Coffee Company outlet?",
        "Is there a Bengawan Coffee Company outlet nearby?",
        "Can you tell me if there's a Bengawan Coffee Company outlet around here?",
        "Where can I find a Bengawan Coffee Company outlet in this area?",
        "Is there a Bengawan Coffee Company outlet in this city?",
        "Can you give me information about the nearest Bengawan Coffee Company outlet?",
        "Are there any Bengawan Coffee Company outlets in this city?",
        "Can you tell me where to find a Bengawan Coffee Company outlet?",
        "Is there a Bengawan Coffee Company outlet in this province?",
        "Can you give me information about Bengawan Coffee Company outlets in this country?",
        "Where can I find a Bengawan Coffee Company shop?",
        "Is there a Bengawan Coffee Company shop nearby?",
        "Can you tell me if there's a Bengawan Coffee Company shop around here?",
        "Where can I find a Bengawan Coffee Company shop in this area?",
        "Is there a Bengawan Coffee Company shop in this city?",
        "Can you give me information about the nearest Bengawan Coffee Company shop?",
        "Are there any Bengawan Coffee Company shops in this city?",
        "Can you tell me where to find a Bengawan Coffee Company shop?",
        "Is there a Bengawan Coffee Company shop in this province?",
        "Can you give me information about Bengawan Coffee Company shops in this country?",
        "Where can I find a Bengawan Coffee Company store?",
        "Is there a Bengawan Coffee Company store nearby?",
        "Can you tell me if there's a Bengawan Coffee Company store around here?",
        "Where can I find a Bengawan Coffee Company store in this area?",
        "Is there a Bengawan Coffee Company store in this city?",
        "Can you give me information about the nearest Bengawan Coffee Company store?",
        "Are there any Bengawan Coffee Company stores in this city?",
        "Can you tell me where to find a Bengawan Coffee Company store?",
        "Is there a Bengawan Coffee Company store in this province?",
        "Can you give me information about Bengawan Coffee Company stores in this country?",
        "Do you know if there's a Bengawan Coffee Company branch nearby?",
        "Do you have information about the nearest Bengawan Coffee Company branch?",
        "Are there any Bengawan Coffee Company branches in this area?",
        "Do you know if there's a Bengawan Coffee Company outlet nearby?",
        "Do you have information about the nearest Bengawan Coffee Company outlet?",
        "Are there any Bengawan Coffee Company outlets in this area?",
        "Do you know if there's a Bengawan Coffee Company shop nearby?",
        "Do you have information about the nearest Bengawan Coffee Company shop?",
        "Are there any Bengawan Coffee Company shops in this area?",
        "Do you know if there's a Bengawan Coffee Company store nearby?",
        "Do you have information about the nearest Bengawan Coffee Company store?",
        "Are there any Bengawan Coffee Company stores in this area?"
      ],
      "responses": [
        "Our Bengawan location is open every day from 7 AM to 10 PM, and our Holis location is open every day from 9 AM to 10 PM. We'll see you soon  !",
        "We're always open for you  , at Bengawan we open at 7 AM and close at 10 PM, and at Holis we open at 9 AM and close at 10 PM. Come visit us!",
        "For Bengawan location, M Company Coffee is open every day from 7 AM to 10 PM, and for Holis location is open every day from 9 AM to 10 PM, See you soon  !"
      ]
    },
    {
      "tag": "lokasi_bengawan",
      "patterns": [
        "Where can I find a nearby coffee shop?",
        "Can you tell me the location of a coffee shop nearby?",
        "Where is the nearest coffee shop?",
        "Which coffee shop is closest to my current location?",
        "Where can I find a coffee shop around here?",
        "Can you provide the location of a coffee shop in this area?",
        "Where are the coffee shops located?",
        "Can you tell me where to find a coffee shop?",
        "Where can I find a coffee shop in this city?",
        "Can you give me the location information of a coffee shop?",
        "Can you give me the address information of a coffee shop?",
        "In which city can I find a coffee shop?",
        "I want to know the address of a coffee shop.",
        "What is the address of a coffee shop?",
        "What is the current address of a coffee shop?",
        "Where is the current address of a coffee shop?",
        "In which city can I find a coffee shop?",
        "I want to know the address of a coffee shop in which city?",
        "Which location is a coffee shop situated?",
        "In which area is a coffee shop located?",
        "Can you tell me where the closest coffee shop is located?",
        "Which address is the nearest coffee shop located at?",
        "Can you provide the location of the nearest coffee shop?",
        "Where is the nearest coffee shop located?",
        "Can you give me the location information of the nearest coffee shop?",
        "Can you give me the address information of the nearest coffee shop?",
        "Where can I find the nearest coffee shop in this city?",
        "Can you give me the correct location information of the nearest coffee shop?",
        "Can you give me the correct address information of the nearest coffee shop?",
        "Where can I find the nearest coffee shop in this area?",
        "Where can I find the nearest coffee shop in this province?",
        "Where can I find the nearest coffee shop in this country?",
        "Is there a coffee shop nearby?",
        "Where can I get a cup of coffee around here?",
        "Are there any coffee shops in this area?",
        "Is there a coffee shop in this neighborhood?",
        "Can you tell me where to find a cafe nearby?",
        "Where can I find a cafe in this city?",
        "Is there a cafe around here?",
        "Are there any cafes in this area?",
        "Can you provide the location of a cafe?",
        "Can you provide the address of a cafe?",
        "In which city can I find a cafe?",
        "I want to know the address of a cafe.",
        "What is the address of a cafe?",
        "What is the current address of a cafe?",
        "Where is the current address of a cafe?",
        "In which city can I find a cafe?",
        "I want to know the address of a cafe in which city?",
        "Which location is a cafe situated?",
        "In which area is a cafe located?",
        "Can you tell me where the closest cafe is located?",
        "Which address is the nearest cafe located at?",
        "Can you provide the location of the nearest cafe?",
        "Where is the nearest cafe located?",
        "Can you give me the location information of the nearest cafe?",
        "Can you give me the address information of the nearest cafe?",
        "Where can I find the nearest cafe in this city?",
        "Can you give me the correct location information of the nearest cafe?",
        "Can you give me the correct address information of the nearest cafe?",
        "Where can I find the nearest cafe in this area?",
        "Where can I find the nearest cafe in this province?",
        "Where can I find the nearest cafe in this country?",
        "Is there a cafe nearby?",
        "Where can I get a cup of coffee around here?",
        "Are there any cafes in this area?",
        "Is there a cafe in this neighborhood?",
        "Where can I find a coffee place?",
        "Is there a coffee shop around here?",
        "Where is the nearest coffee place?",
        "Can you provide the location of a coffee place?",
        "Can you provide the address of a coffee place?",
        "In which city can I find a coffee place?",
        "I want to know the address of a coffee place.",
        "What is the address of a coffee place?",
        "What is the current address of a coffee place?",
        "Where is the current address of a coffee place?",
        "In which city can I find a coffee place?",
        "I want to know the address of a coffee place in which city?",
        "Which location is a coffee place situated?",
        "In which area is a coffee place located?",
        "Can you tell me where the closest coffee place is located?",
        "Which address is the nearest coffee place located at?",
        "Can you provide the location of the nearest coffee place?",
        "Where is the nearest coffee place located?",
        "Can you give me the location information of the nearest coffee place?",
        "Can you give me the address information of the nearest coffee place?",
        "Where can I find the nearest coffee place in this city?",
        "Can you give me the correct location information of the nearest coffee place?",
        "Can you give me the correct address information of the nearest coffee place?",
        "Where can I find the nearest coffee place in this area?",
        "Where can I find the nearest coffee place in this province?",
        "Where can I find the nearest coffee place in this country?",
        "Is there a coffee place nearby?",
        "Where can I get a cup of coffee around here?",
        "Are there any coffee places in this area?",
        "Is there a coffee place in this neighborhood?",
        "Where can I find the address of the Bengawan branch?",
        "Can you tell me the location of the Bengawan branch?",
        "Where is the Bengawan branch situated?",
        "Which address is the Bengawan branch located at?",
        "Where can we find the Bengawan branch?",
        "Can you provide the location of the Bengawan branch?",
        "Where are the Bengawan branches located?",
        "Can you tell me where to find the Bengawan branch?",
        "Where is the Bengawan branch located?",
        "Can you give me the location information of the Bengawan branch?",
        "Can you give me the address information of the Bengawan branch?",
        "In which city is the Bengawan branch located?",
        "Where can I find the Bengawan branch in this city?",
        "Can you give me the correct location information of the Bengawan branch?",
        "Can you give me the correct address information of the Bengawan branch?",
        "Where can I find the Bengawan branches in this city?",
        "Where can I find the Bengawan branches in this area?",
        "Where can I find the Bengawan branches in this province?",
        "Where can I find the Bengawan branches in this country?",
        "Where should I go to reach the Bengawan branch?",
        "Where is the address of the Bengawan branch?",
        "Where can I find the Bengawan branch?",
        "Can you give me the location information of the M Coffee Company branch in Bengawan?",
        "Where is the location of the M Coffee Company branch in Bengawan?",
        "Where can I find the M Coffee Company branch in Bengawan?",
        "Can you give me the address of the M Coffee Company branch in Bengawan?",
        "Can you tell me the location of the M Coffee Company branch in Bengawan?",
        "I want to know the address of the Bengawan branch.",
        "What is the address of the Bengawan branch?",
        "What is the current address of the Bengawan branch?",
        "Where is the current address of the Bengawan branch?",
        "In which city can I find the Bengawan branch?",
        "I want to know the address of the Bengawan branch in which city?",
        "Which location is the Bengawan branch situated?",
        "In which area is the Bengawan branch located?",
        "Can you tell me where the closest Bengawan branch is located?",
        "Which address is the nearest Bengawan branch located at?",
        "Can you provide the location of the nearest Bengawan branch?",
        "Where is the nearest Bengawan branch located?",
        "Can you give me the location information of the nearest Bengawan branch?",
        "Can you give me the address information of the nearest Bengawan branch?",
        "Where can I find the nearest Bengawan branch in this city?",
        "Can you give me the correct location information of the nearest Bengawan branch?",
        "Can you give me the correct address information of the nearest Bengawan branch?",
        "Where can I find the nearest Bengawan branch in this area?",
        "Where can I find the nearest Bengawan branch in this province?",
        "Where can I find the nearest Bengawan branch in this country?",
        "Can you provide information about the locations of Bengawan branches?",
        "Where is Bengawan located?",
        "Where can I find Bengawan?",
        "What's the address of Bengawan?",
        "Can you give me the address of Bengawan?",
        "Where are the branches of Bengawan located?",
        "Where is the place for Bengawan?",
        "Where should I go if I want to visit a Bengawan branch?",
        "What's the address of the Bengawan branch?",
        "How do I get to the address of the Bengawan branch?",
        "Where is the location of the coffeeshop?",
        "What's the distance from here?",
        "Where is M Coffee Company located?",
        "In which direction is M Coffee Company located?",
        "Is M Coffee Company located in the city center?",
        "Can I know the complete address of M Coffee Company?",
        "Is M Coffee Company located in a residential or commercial area?",
        "Is M Coffee Company located next to a bookstore?",
        "How long does it take to reach M Coffee Company from the train station?",
        "Which street is M Coffee Company located on?",
        "Is M Coffee Company near a park?",
        "How do I get to the place from the airport?",
        "Can you provide me with the complete address of the place?",
        "Which campus is the place located near?",
        "Are there any famous landmarks around the place?",
        "Is the place located near a parking area?",
        "Is the place located on a main road?",
        "Which side is the place located on, and from which angle should I search for it?",
        "What's the easiest way to reach the place from the highway?",
        "Is there a bus stop near M Coffee Company?",
        "Is M Coffee Company located on a street corner or in the middle of a block?",
        "Is there available parking space near M Coffee Company?",
        "Is M Coffee Company located in a busy or quiet area?",
        "Is M Coffee Company situated in a multi-story building or a house?",
        "What other restaurants are near M Coffee Company?",
        "Is the place near a bus station or not?",
        "How much time does it take to walk to the place from the nearest hotel?",
        "Is the place near a beach?",
        "Is the place located in a tourist area?",
        "Can you tell me the nearest landmark to the place?",
        "Is the place near a market?",
        "How do I reach the place from the nearest shopping center?",
        "Is there a train station near the place?",
        "Is the place located across from a park?",
        "How long does it take to drive to the place from my location?",
        "Is the place near a highway or a small road?",
        "Is the place near a police station?",
        "How do I get to the place from the bus terminal?",
        "Are there any banks near the place?",
        "Is the place located in a commercial or office area?",
        "Is there a children's playground near M Coffee Company?",
        "Is M Coffee Company located in a residential or business area?",
        "How do I get to M Coffee Company from the nearest train station?",
        "Is there easy access to M Coffee Company?",
        "Is M Coffee Company located on a busy or smooth traffic road?",
        "Is there a pharmacy near the place?",
        "Is the place near an industrial area?",
        "Is there a bus station near the place?",
        "Is the place near a sports facility?",
        "Is the place near a historical area?",
        "Is the place near a shopping center?",
        "Is there a train station near M Coffee Company?",
        "Is M Coffee Company easily accessible by public transportation?",
        "Is there a children's playground near M Coffee Company?",
        "Is M Coffee Company near a school?",
        "How do I get to the place from the nearest residential area?",
        "Is the place near a business district or office center?",
        "Is there car parking available near the place?",
        "Is the place near an art or history museum?",
        "Can you tell me the complete address of the M Coffee Company branch in Bengawan?",
        "Where is the location of the Bengawan branch?",
        "How do I get to the Bengawan branch?",
        "I want to know the complete address of the Bengawan branch.",
        "Can you provide the address of the Bengawan branch?",
        "Where exactly is the Bengawan branch located?",
        "Is the Bengawan branch located near tourist attractions?",
        "Which street is the Bengawan branch located on?",
        "Please tell me the address of the mentioned coffeeshop.",
        "Can you give me the detailed address?",
        "Is the coffeeshop located near a train station?",
        "Is it close to the airport?",
        "What's the distance from the coffeeshop to the city center of Bandung?",
        "How far is the coffeeshop from the main road?",
        "How do I get to the place from the city center?",
        "Is the place near educational institutions?",
        "Within how many kilometers is the place from the nearest bus station?",
        "How long does it take to reach the place from the train station?",
        "Is the place near an industrial area?",
        "Are there any interesting places around the place?",
        "Is the place near a park or green area?",
        "How close is the place to other dining places?",
        "Is the place near entertainment spots or nightclubs?",
        "Is there an MRT station near the coffeeshop?",
        "Is the coffeeshop near a library?",
        "How do I get to the coffeeshop from nearby tourist spots?",
        "Is the place near historical sites or landmarks?",
        "Is the place near a shopping area or mall?",
        "Is there a train station or bus stop near M Coffee Company?",
        "Is the coffeeshop located on a main road or a small street?",
        "Is the coffeeshop near a police station or a police post?",
        "How do I get to the coffeeshop from the nearest bus terminal?",
        "Are there any banks or ATMs around the place?",
        "Is the place near a commercial or office area?",
        "Is there a children's playground near M Coffee Company?",
        "Is the place located in a residential area or a business district?",
        "How do I get to M Coffee Company from the nearest train station?",
        "Is there easy access to M Coffee Company?",
        "Is M Coffee Company located on a busy road or in a quiet neighborhood?",
        "Is there a pharmacy or a clinic near the place?",
        "Is the place near an industrial or commercial area?",
        "Is there a bus station near the place?",
        "Is the place near sports or recreational facilities?",
        "Is the place near historical or heritage sites?",
        "Is the place near a shopping area or mall?",
        "Is there a train station or bus stop near M Coffee Company?",
        "Is M Coffee Company easily accessible by public transportation?",
        "Is there a children's playground near M Coffee Company?",
        "Is M Coffee Company near a school?",
        "How do I get to the place from the nearest residential area?",
        "Is the place near a business district or office center?",
        "Is there car parking available near the place?",
        "Is the place near an art gallery or museum?",
        "Where is the address of the Bengawan branch?",
        "Where is Bengawan located?",
        "Where is the Bengawan branch located?",
        "Where should I go if I want to visit a Bengawan branch?",
        "Where is the Bengawan branch located?",
        "Provide information about the location of the Bengawan branch.",
        "Where is the location of the Bengawan branch?",
        "Where is the Bengawan branch in Bengawan?",
        "Where is the address of the Bengawan branch?",
        "Where is the current location of the Bengawan branch?",
        "Which location of the Bengawan branch is strategic?",
        "Which location of the Bengawan branch is the most strategic?",
        "Is the coffeeshop near concert venues or music events?",
        "How do I get to the coffeeshop from the nearest train station?",
        "Is there a car parking area near the place?",
        "Is the place near natural attractions or tourist spots?",
        "Is the place located near a central shopping area or mall?",
        "Is there a bus station or bus stop near the place?",
        "Is the place located on a main road or a smaller road?",
        "Is the place near a shopping center or mall?",
        "Is the place near a market?",
        "How do I get to the place from the nearest airport?",
        "Is the place near a police station or police post?",
        "Is the place near a park or open space?",
        "Is there ample parking space near the place?",
        "Is the coffeeshop near an art gallery or art museum?",
        "How do I get to the place from the nearest shopping center?",
        "Is the place near historical sites or landmarks?",
        "Is there a train station near the place?",
        "Is the place located across from a park?",
        "How long does it take to drive to the place from my location?",
        "Is the place near a highway or a smaller road?",
        "Is the place near a police station?",
        "How do I get to the place from the nearest bus terminal?",
        "Are there any banks near the place?",
        "Is the place located in a commercial or office area?",
        "Is there a children's playground near the place?",
        "Is the place near a residential area or business district?",
        "How do I get to M Coffee Company from the nearest train station?",
        "Is there easy access to M Coffee Company?",
        "Is M Coffee Company located on a busy or smooth traffic road?",
        "Is there a pharmacy near the place?",
        "Is the place near an industrial area?",
        "Is there a bus station near the place?",
        "Is the place near sports or recreational facilities?",
        "Is the place near historical or heritage sites?",
        "Is the place near a shopping center or mall?",
        "Is there a train station or bus stop near M Coffee Company?",
        "Is M Coffee Company easily accessible by public transportation?",
        "Is there a children's playground near M Coffee Company?",
        "Is M Coffee Company near a school?",
        "How do I get to the place from the nearest residential area?",
        "Is the place near a business district or office center?",
        "Is there car parking available near the place?",
        "Is the place near an art gallery or museum?",
        "Can you provide the complete address of the M Coffee Company branch in Bengawan?",
        "Where is the location of the Bengawan branch?",
        "How do I get to the Bengawan branch?",
        "I want to know the complete address of the Bengawan branch.",
        "Can you provide the address of the Bengawan branch?",
        "Where exactly is the Bengawan branch located?",
        "Is the Bengawan branch located near tourist attractions?",
        "Which street is the Bengawan branch located on?",
        "Please tell me the address of the mentioned coffeeshop.",
        "Can you give me the detailed address?",
        "Is the coffeeshop located near a train station?",
        "Is it close to the airport?",
        "What's the distance from the coffeeshop to the city center of Bandung?",
        "How far is the coffeeshop from the main road?",
        "How do I get to the place from the city center?",
        "Is the place near educational institutions?",
        "Within how many kilometers is the place from the nearest bus station?",
        "How long does it take to reach the place from the train station?",
        "Is the place near an industrial area?",
        "Are there any interesting places around the place?",
        "Is the place near a park or green area?",
        "How close is the place to other dining places?",
        "Is the place near entertainment spots or nightclubs?",
        "Is there an MRT station near the coffeeshop?",
        "Is the coffeeshop near a library?",
        "How do I get to the coffeeshop from nearby tourist spots?",
        "Is the place near historical sites or landmarks?",
        "Is the place near a shopping area or mall?",
        "Is there a train station or bus stop near M Coffee Company?",
        "Is the coffeeshop located on a main road or a small street?",
        "Is the coffeeshop near a police station or a police post?",
        "How do I get to the coffeeshop from the nearest bus terminal?",
        "Are there any banks or ATMs around the place?",
        "Is the place near a commercial or office area?",
        "Is there a children's playground near M Coffee Company?",
        "Is the place located in a residential area or a business district?",
        "How do I get to M Coffee Company from the nearest train station?",
        "Is there easy access to M Coffee Company?",
        "Is M Coffee Company located on a busy road or in a quiet neighborhood?",
        "Is there a pharmacy or a clinic near the place?",
        "Is the place near an industrial or commercial area?",
        "Is there a bus station near the place?",
        "Is the place near sports or recreational facilities?",
        "Is the place near historical or heritage sites?",
        "Is the place near a shopping area or mall?",
        "Is there a train station or bus stop near M Coffee Company?",
        "Is M Coffee Company easily accessible by public transportation?",
        "Is there a children's playground near M Coffee Company?",
        "Is M Coffee Company near a school?",
        "How do I get to the place from the nearest residential area?",
        "Is the place near a business district or office center?",
        "Is there car parking available near the place?",
        "Is the place near an art gallery or museum?",
        "Where is the address of the Bengawan branch?",
        "Where is Bengawan located?",
        "Where is the Bengawan branch located?",
        "Where should I go if I want to visit a Bengawan branch?",
        "Where is the Bengawan branch located?",
        "Provide information about the location of the Bengawan branch.",
        "Where is the location of the Bengawan branch?",
        "Where is the Bengawan branch in Bengawan?",
        "Where is the address of the Bengawan branch?",
        "Where is the current location of the Bengawan branch?",
        "Which location of the Bengawan branch is strategic?",
        "Which location of the Bengawan branch is the most strategic?",
        "Is the coffeeshop near concert venues or music events?",
        "How do I get to the coffeeshop from the nearest train station?",
        "Is there a car parking area near the place?",
        "Is the place near natural attractions or tourist spots?",
        "Is the place located near a central shopping area or mall?",
        "Is there a bus station or bus stop near the place?",
        "Is the place located on a main road or a smaller road?",
        "Is the place near a shopping center or mall?",
        "Is the place near a market?",
        "How do I get to the place from the nearest airport?",
        "Is the place near a police station or police post?",
        "Is the place near a park or open space?",
        "Is there ample parking space near the place?",
        "Is the coffeeshop near an art gallery or art museum?",
        "How do I get to the place from the nearest shopping center?",
        "Is the place near historical sites or landmarks?",
        "Is there a train station near the place?",
        "Is the place located across from a park?",
        "How long does it take to drive to the place from my location?",
        "Is the place near a highway or a smaller road?",
        "Is the place near a police station?",
        "How do I get to the place from the nearest bus terminal?",
        "Are there any banks near the place?",
        "Is the place located in a commercial or office area?",
        "Is there a children's playground near the place?",
        "Is the place near a residential area or business district?",
        "How do I get to M Coffee Company from the nearest train station?",
        "Is there easy access to M Coffee Company?",
        "Is M Coffee Company located on a busy or smooth traffic road?",
        "Is there a pharmacy near the place?",
        "Is the place near an industrial area?",
        "Is there a bus station near the place?",
        "Is the place near sports or recreational facilities?",
        "Is the place near historical or heritage sites?",
        "Is the place near a shopping center or mall?",
        "Is there a train station or bus stop near M Coffee Company?",
        "Is M Coffee Company easily accessible by public transportation?",
        "Is there a children's playground near M Coffee Company?",
        "Is M Coffee Company near a school?",
        "How do I get to the place from the nearest residential area?",
        "Is the place near a business district or office center?",
        "Is there car parking available near the place?",
        "Is the place near an art gallery or museum?"
      ],
      "responses": [
        "You can find us at Jl. Bengawan No.28, Cihapit, Kec. Bandung Wetan, Kota Bandung, Jawa Barat 40114 , or click this link for direction : https://goo.gl/maps/ozbxWLiWuyQedRy6A. Can't wait to see you!",
        ", you can come directly to M Coffee Company Bengawan at Jl. Bengawan No.28, Cihapit, Kec. Bandung Wetan, Kota Bandung, Jawa Barat 40114 or follow this link for direction : https://goo.gl/maps/ozbxWLiWuyQedRy6A",
        "M Coffee Company Bengawan is located at Jl. Bengawan No.28, Cihapit, Kec. Bandung Wetan, Kota Bandung, Jawa Barat 40114, or  you can check this link for direction https://goo.gl/maps/ozbxWLiWuyQedRy6A we are waiting for your visit <3"
      ]
    },
    {
      "tag": "beverages_recommendation",
      "patterns": [
        "What type of drink is most often bought?",
        "What is the best-selling drink?",
        "What is the most delicious drink according to you?",
        "What fresh drink do you recommend?",
        "What drink is suitable for summer?",
        "What drink is suitable for winter?",
        "What drink is suitable for the morning?",
        "What drink is suitable for the evening?",
        "What drink is suitable for the night?",
        "What drink is suitable for diet?",
        "What drink is suitable for relaxing?",
        "What drink is suitable for working?",
        "What drink is suitable for gathering with friends?",
        "What drink is suitable for reading a book?",
        "What drink is suitable for working in the office?",
        "What drink is suitable for vacation?",
        "What drink is suitable for walking around?",
        "What is the trendy drink available now?",
        "What is the currently popular drink?",
        "What is the popular drink now?",
        "What drink is considered extremely delicious?",
        "What is the most popular drink at the moment?",
        "What drink is the most loved at the moment?",
        "What drink is the most ordered at the moment?",
        "What drink is the most recommended at the moment?",
        "What drink is the most famous at the moment?",
        "What drink is the most adored at the moment?",
        "What drink is the most popular at the moment?",
        "What drink is the most top at the moment?",
        "What drink is the best seller at the moment?",
        "What drink is the most popular and sold at the moment?",
        "What drink is the most loved by customers at the moment?",
        "What drink is the most eagerly awaited at the moment?",
        "What drink is the most desired at the moment?",
        "What drink is the most waited for at the moment?",
        "What drink is the most expected at the moment?",
        "What drink is considered cool at the moment?",
        "What drink is considered popular at the moment?",
        "What drink is currently in trend?",
        "What drink is currently a hit?",
        "What drink is a must-try?",
        "What is the most favorite drink?",
        "What is the most delicious drink?",
        "What is the most recommended drink?",
        "What drink is the most ordered?",
        "What is the most highly recommended drink?",
        "What is the top-selling drink?",
        "What is the most popular drink currently?",
        "What drink is the most loved by customers currently?",
        "What drink is the most recommended currently?",
        "What drink is the most famous currently?",
        "What drink is the best seller currently?",
        "What drink is the top seller currently?",
        "What drink is the most popular and sold currently?",
        "What drink is the most loved by customers?",
        "What drink is the most recommended by customers?",
        "What drink is the most famous among customers?",
        "What drink is the best seller among customers?",
        "What drink is the top seller among customers?",
        "What drink is the most popular and sold among customers?",
        "What is a recommended drink other than coffee?",
        "What non-coffee drinks are frequently ordered?",
        "Can you recommend a non-coffee drink for dieting?",
        "What is a recommended drink for someone who doesn't like coffee?",
        "Can you recommend a caffeine-free drink for those with insomnia?",
        "Can you recommend a non-coffee drink for those with heart problems?",
        "What are the menu options for caffeine-free drinks that are delicious?",
        "Can you recommend a non-coffee drink that is tasty?",
        "What non-coffee drinks are recommended?",
        "Can you suggest a drink other than coffee?",
        "What are the options for non-coffee drinks?",
        "Are there any tasty non-coffee drinks?",
        "What are some recommended non-coffee drinks?",
        "Can you recommend a drink that doesn't contain caffeine?",
        "Can you recommend a drink that doesn't contain coffee?",
        "What is a caffeine-free drink that is delicious?",
        "Can you suggest a caffeine-free drink?",
        "What is a recommended caffeine-free drink?",
        "What are the options for caffeine-free drinks?",
        "Are there any delicious caffeine-free drinks?",
        "What are some recommended caffeine-free drinks?",
        "Can you recommend a drink other than coffee?",
        "Can you recommend a non-coffee drink?",
        "What is a recommended non-coffee drink?",
        "Can you recommend a drink that doesn't have a coffee scent?",
        "Can you recommend a drink that doesn't have a coffee aroma?",
        "What are the popular coffee choices?",
        "What beverages are commonly ordered here?",
        "How can I find non-coffee beverages that I might like?",
        "Do you have any recommendations for tasty coffee?",
        "Any suggestions for beverages?",
        "Which coffee do you recommend?",
        "I want to try some delicious coffee, any suggestions?",
        "What beverages do most customers prefer?",
        "Are there any recommended coffees to try here?",
        "What other tasty beverages are available besides coffee?",
        "Can you suggest some non-caffeinated beverages?",
        "What are some recommended coffees to try?",
        "What are the trendy beverages available?",
        "Recommend non-coffee beverages that are rich in vitamins and minerals.",
        "Could you recommend any delicious coffee here?",
        "What are the alternative beverage options besides coffee?",
        "What coffee menu items do you recommend?",
        "Are there any caffeine-free beverage options?",
        "What coffee do you recommend?",
        "Which coffee tastes the best?",
        "What is the most recommended coffee?",
        "What coffee is recommended?",
        "What coffee do you suggest?",
        "What cool coffee is there?",
        "What coffee is currently popular?",
        "What coffee is currently trending?",
        "What coffee is currently the best?",
        "What coffee is currently cool?",
        "What coffee is currently popular among people?",
        "What coffee is currently favored among people?",
        "Is there any coffee that you can recommend for me to try?",
        "I want to try a recommended coffee, what do you suggest?",
        "I want to try the most popular type of coffee, do you have any recommendations?",
        "I want to try a coffee with a unique taste, do you have any recommendations?",
        "How can I get coffee recommendations from you?",
        "I want to buy a recommended coffee, how can I do that?",
        "Do you have any coffee recommendations for beginners?",
        "What is your coffee recommendation?",
        "What coffee menu do you recommend to serve deliciously?",
        "What coffee menu do you suggest to serve deliciously?",
        "Please give a recommendation for a delicious coffee",
        "What coffee do you recommend to serve deliciously?",
        "What coffee drink do you suggest?",
        "What coffee do you recommend to consume deliciously?",
        "What coffee do you suggest to serve deliciously?",
        "What coffee do you recommend for personal preference?",
        "What coffee drink do you suggest to consume deliciously?",
        "What coffee menu do you recommend for personal preference?",
        "What coffee do you suggest for personal preference?",
        "What is the most delicious coffee you know?",
        "What is the most popular coffee you know?",
        "What is the best coffee you know?",
        "What is your top pick for coffee?",
        "What is the most unique coffee you know?",
        "What is the most traditional coffee you know?",
        "What is the most well-known coffee you know?",
        "What is the most exotic coffee you know?",
        "What is the most premium coffee you know?",
        "What is the most sought-after coffee you know?",
        "What is the most expensive coffee you know?",
        "What is the most budget-friendly coffee you know?",
        "What is the most accessible coffee you know?",
        "What is the most rare coffee you know?",
        "What is the most flavorful coffee you know?",
        "What is the most aromatic coffee you know?",
        "What is the most smooth coffee you know?",
        "What is the most balanced coffee you know?",
        "What is the most rich coffee you know?",
        "What is the most bold coffee you know?",
        "What is the most complex coffee you know?",
        "What is the most simple coffee you know?",
        "What is the most classic coffee you know?",
        "What is the most modern coffee you know?",
        "What is the most trendy coffee you know?",
        "What is the most timeless coffee you know?",
        "What's the most recommended coffee?",
        "What's the coolest coffee?",
        "What's the best coffee?",
        "What coffee is hot right now?",
        "What coffee is popular?",
        "Are there any recommended coffees for me to try?",
        "I want to try a recommended coffee, what can you suggest?",
        "I want to try a unique-tasting coffee, do you have any recommendations?",
        "Are there any coffee options you recommend for beginners?",
        "What's the recommended coffee?",
        "What's the suggested coffee?",
        "What coffee do you suggest for a delicious presentation?",
        "What coffee do you recommend for a delicious presentation?",
        "Please give me a recommendation for a delicious coffee",
        "What coffee is recommended for a delicious presentation?",
        "What's the recommended coffee drink?",
        "What coffee is recommended for a delicious consumption?",
        "What coffee menu do you recommend for a delicious presentation?",
        "What coffee is recommended for personal taste?",
        "What coffee drink do you recommend for a delicious consumption?",
        "What coffee menu do you recommend for personal taste?",
        "What coffee do you recommend for personal taste?",
        "What coffee do you suggest for personal taste?",
        "What's the most popular coffee?",
        "What's the hottest coffee?",
        "What's the trendiest coffee?",
        "What's the most delicious coffee?",
        "What's the most fashionable coffee?",
        "What's the most beloved coffee?",
        "What's the most adored coffee?",
        "What can I try as an alternative to coffee?",
        "Please recommend some delicious coffees available here.",
        "What non-coffee beverage is refreshing for hot weather?",
        "Recommend the best coffee to try.",
        "What are some refreshing beverages?",
        "Suggest non-coffee beverages with calming aromas.",
        "Recommend some delicious coffee at [Coffee Shop Name].",
        "What drinks do you recommend for those who don't like coffee?",
        "What beverages are suitable for the current situation?",
        "Do you have any favorite drinks to recommend?",
        "Which beverages are the bestsellers?",
        "Recommend some cool coffee at [Coffee Shop Name].",
        "What beverages are recommended here?",
        "Can you recommend your favorite beverages?",
        "What drink do you think is the most delicious?",
        "What non-coffee drinks are liked by customers?",
        "Can you recommend any beverages?",
        "Can you tell me the most delicious drink here?",
        "What non-coffee options do you have?",
        "What beverages are highly recommended?",
        "Please recommend some beverages to try.",
        "Suggest non-coffee beverages that are good for digestion.",
        "What recommended coffee is there?",
        "What coffee menu items are recommended here?",
        "Could you give me a coffee recommendation?",
        "What coffee is currently popular in [Coffee Shop Name]?",
        "What are the recommended coffee choices here?",
        "Which coffee should I try?",
        "What coffee should I order if I want something delicious?",
        "What drink do you recommend if I don't like coffee?",
        "What coffee is recommended to try here?",
        "Please make a recommendation.",
        "What coffee is highly recommended?",
        "Do you have any coffee recommendations I can try?",
        "What drink do you recommend for those who don't like coffee?",
        "Recommend refreshing non-coffee beverages.",
        "What non-coffee drinks are recommended to try?",
        "Are there any special coffees recommended at [Coffee Shop Name]?",
        "What coffee is most recommended?",
        "What are the popular beverages?",
        "Looking for non-coffee beverages, what do you recommend?",
        "What is your recommendation?",
        "What beverage is suitable for sensitive stomachs?",
        "What coffee menu items are delicious at [Coffee Shop Name]?",
        "Please recommend a coffee.",
        "What non-coffee beverages do you recommend?",
        "Are there any popular coffee choices?",
        "What non-coffee beverages are suitable for refreshing after exercise?",
        "What is the most delicious coffee to try at [Coffee Shop Name]?",
        "Which coffee is the best?",
        "What is the best coffee to drink here?",
        "What is a good alternative to coffee?",
        "What coffee is recommended?",
        "Are there any special beverages besides coffee?",
        "What coffee is worth trying at [Coffee Shop Name]?",
        "What is a good non-coffee option?",
        "What non-coffee beverages are recommended?",
        "What are the most recommended beverages here?",
        "Please recommend some beverages to try.",
        "Suggest non-coffee beverages that aid digestion.",
        "What recommended coffee is available?",
        "What coffee is most popular in [Coffee Shop Name]?",
        "What coffee is recommended here?",
        "What coffee is worth trying?",
        "Recommend something other than coffee.",
        "What are the most recommended drinks?",
        "Can you recommend a coffee to try?",
        "What beverages are recommended for those who don't like coffee?",
        "Recommend refreshing non-coffee beverages that are healthy.",
        "What non-coffee beverages do you suggest trying?",
        "Are there any recommended special coffees?",
        "What coffee is most recommended?",
        "What are the popular beverages?",
        "Looking for non-coffee beverages, what do you recommend?",
        "What is your recommendation?",
        "What beverage is suitable for sensitive stomachs?",
        "What coffee menu items are delicious at [Coffee Shop Name]?",
        "Please recommend a coffee.",
        "What non-coffee beverages do you recommend?",
        "Are there any popular coffee choices?",
        "What non-coffee beverages are suitable for refreshing after exercise?",
        "What is the most delicious coffee to try at [Coffee Shop Name]?",
        "Which coffee is the best?",
        "What is the best coffee to drink here?",
        "What is a good alternative to coffee?",
        "What coffee is recommended?",
        "Are there any special beverages besides coffee?",
        "What coffee is worth trying at [Coffee Shop Name]?",
        "What is a good non-coffee option?",
        "What non-coffee beverages are recommended?",
        "What are the most recommended beverages here?",
        "Please recommend some beverages to try.",
        "Suggest non-coffee beverages that aid digestion.",
        "What recommended coffee is available?",
        "What coffee is most popular in [Coffee Shop Name]?",
        "What coffee is recommended here?",
        "What coffee is worth trying?",
        "Recommend something other than coffee.",
        "What are the most recommended drinks?",
        "Can you recommend a coffee to try?",
        "What beverages are recommended for those who don't like coffee?",
        "Recommend refreshing non-coffee beverages that are healthy.",
        "What non-coffee beverages do you suggest trying?",
        "Are there any recommended special coffees?",
        "What coffee is most recommended?",
        "What drinks are highly requested here?",
        "Looking for non-coffee beverages, what do you suggest?",
        "What is your recommendation?",
        "What beverage is suitable for sensitive stomachs?",
        "What coffee menu items are delicious at [Coffee Shop Name]?",
        "Please recommend a coffee.",
        "What non-coffee beverages do you recommend?",
        "Are there any popular coffee choices?",
        "What non-coffee beverages are suitable for refreshing in hot weather?",
        "What is the most delicious coffee to try at [Coffee Shop Name]?",
        "Which coffee is the best?",
        "What is the best coffee to drink here?",
        "What is a good alternative to coffee?",
        "Are there any beverages suitable for celebrating birthdays?",
        "Can you recommend tasty caffeine-free beverages?",
        "I want to try a beverage with a touch of brown sugar, any suggestions?",
        "Are there any beverages that can uplift the mood?",
        "What beverage is best for quenching thirst?",
        "Can I have a coffee with a little caramel syrup?",
        "Are there any beverages with an Asian-inspired flavor?",
        "I'm looking for Instagram-worthy beverages, any suggestions?",
        "Are there any beverages suitable for surprise parties?",
        "Can you recommend refreshing orange-flavored beverages?",
        "I want to try a beverage with a white chocolate touch, any suggestions?",
        "What is a suitable drink for someone who doesn't like coffee?"
      ],
      "responses": [
        "For drink recommendations, you can choose from several options with the following writing format: \n \"/recommend type (coffee/tea/other) sweetness level (not/a bit/moderate/strong) acidity level (not/a bit/moderate/strong) savoriness level (not/a bit/moderate/strong) temperature (cold/hot) with milk (yes/no) and fruit flavor (yes/no)\".\n Make sure to fill in your preferences in order, and there should be **no comma** between preferences. Begin your message with **\"/recommend\"**. \n\nExamples of correct writing:\n/recommend coffee strong not moderate cold yes yes\n\nExamples of incorrect writing:\nrecommend others, hot, bitter, don't want savory, yes, don't want."
      ]
    },
    {
      "tag": "rsvp",
      "patterns": [
        "Are there any specific requirements for making a reservation at [Coffee Shop Name]?",
        "Does [Coffee Shop Name] accept table reservations?",
        "How can I make a table reservation at [Coffee Shop Name]?",
        "What are the requirements for booking a table at [Coffee Shop Name]?",
        "What is the procedure for making a reservation at [Coffee Shop Name]?",
        "Is there a time limit for making a table reservation at [Coffee Shop Name]?",
        "How can I check the availability of tables for reservation at [Coffee Shop Name]?",
        "Does [Coffee Shop Name] offer online reservation services?",
        "Does [Coffee Shop Name] accept table reservations for weddings?",
        "How can I modify or cancel a table reservation at [Coffee Shop Name]?",
        "Are there any special benefits to making a reservation at [Coffee Shop Name]?",
        "How can I reserve a table for a large event at [Coffee Shop Name]?",
        "What is the procedure for reserving a table at [Coffee Shop Name] on holidays?",
        "Does [Coffee Shop Name] provide reservation services for large groups?",
        "Is there an upfront payment policy for reservations at [Coffee Shop Name]?",
        "How can I check the status of my reservation at [Coffee Shop Name]?",
        "Can I RSVP for an event at [Coffee Shop Name]?",
        "How can I make a table reservation at [Coffee Shop Name]?",
        "Are there any specific requirements for making evening reservations at [Coffee Shop Name]?",
        "How can I make an online reservation at [Coffee Shop Name]?",
        "Does [Coffee Shop Name] accept reservations over the phone?",
        "I want to make a reservation, how do I go about it?",
        "What is the process for online reservations at [Coffee Shop Name]?",
        "Does [Coffee Shop Name] accept advance reservations?",
        "How can I arrange a reservation at [Coffee Shop Name]?",
        "What are the terms and conditions for making a reservation at [Coffee Shop Name]?",
        "How do I go about making a reservation at [Coffee Shop Name]?",
        "Are there any specific ways to make a reservation at [Coffee Shop Name]?",
        "Who should I contact for reservations at [Coffee Shop Name]?",
        "Please guide me on making a reservation at [Coffee Shop Name].",
        "Are there any specific requirements that must be met for reservations at [Coffee Shop Name]?",
        "I want to make a table reservation, can you guide me through the steps at [Coffee Shop Name]?",
        "Does [Coffee Shop Name] provide table reservation services?",
        "How can I secure a reservation at [Coffee Shop Name]?",
        "Is there a limit to the number of guests for reservations at [Coffee Shop Name]?",
        "How can I check the availability of tables at [Coffee Shop Name] before making a reservation?",
        "Does [Coffee Shop Name] accept reservations online?",
        "Are there any special benefits if I make a reservation at [Coffee Shop Name]?",
        "How can I make a reservation for a special event at [Coffee Shop Name]?",
        "Does [Coffee Shop Name] provide table reservation services for weddings?",
        "How can I cancel or modify a reservation at [Coffee Shop Name]?",
        "Does [Coffee Shop Name] have an upfront payment policy for reservations?",
        "Is there a possibility of getting a discount for making a reservation at [Coffee Shop Name]?",
        "Is there a time limit for reservations at [Coffee Shop Name]?",
        "I want to reserve a table at [Coffee Shop Name], how can I do that?",
        "How can I check the availability of tables for reservations at [Coffee Shop Name]?",
        "How can I reserve a table for a large event at [Coffee Shop Name]?",
        "How can I reserve a table for a wedding event at [Coffee Shop Name]?",
        "How can I make a reservation at [Coffee Shop Name]?",
        "How can I RSVP at [Coffee Shop Name]?",
        "Are there any specific requirements for RSVP at [Coffee Shop Name]?",
        "How can I make an online reservation at [Coffee Shop Name]?",
        "I want to reserve a table at [Coffee Shop Name], how can I do that?",
        "What are the benefits of RSVPing at [Coffee Shop Name]?",
        "Does [Coffee Shop Name] accept table reservations?",
        "I am unsure about how to make a reservation at [Coffee Shop Name], can you help?",
        "What are the terms and conditions for making reservations at [Coffee Shop Name]?",
        "How can I go about making a reservation at [Coffee Shop Name]?",
        "Are there any requirements for making reservations at [Coffee Shop Name]?",
        "How can I make a reservation at [Coffee Shop Name]?",
        "How can I make an online reservation at [Coffee Shop Name]?",
        "Is there a time limit for reservations at [Coffee Shop Name]?",
        "Can I reserve a table at your coffee shop?",
        "Can I make a reservation at your place?",
        "What is your reservation policy?",
        "How far in advance do I need to make a reservation?",
        "How can I book a table at your coffee shop?",
        "Do you accept reservations for large groups?",
        "What is the maximum number of people I can reserve for?",
        "How can I make an online reservation?",
        "What types of food and drinks can I order through reservations?",
        "Is there a time limit for reservations at your coffee shop?",
        "Do I need to pay upfront when making a reservation?",
        "Can I change or cancel my reservation?",
        "Are there specific times when you don't accept reservations?",
        "Are there any specific requirements for reservations at your coffee shop?",
        "Do you accept reservations for birthday parties?",
        "How can I book a spot in the outdoor area of M Coffee Company?",
        "Are there any special facilities that I can reserve?",
        "Can I make a reservation for a business meeting at your M Coffee Company?",
        "How long is the reservation time available for each table?",
        "Are there strict time limits for reservations during busy hours?",
        "How can regular customers arrange reservations at M Coffee Company?",
        "Do you have any specific reservation policies for regular customers?",
        "Can I book a spot for a special event?",
        "Can I get a reservation for a table near the window?",
        "Do you accept reservations for live music events?",
        "How long can I keep a reservation before it gets canceled?",
        "Is there an age limit for making reservations?",
        "How can I view the menu list before making a reservation?",
        "Are there any additional fees for making reservations?",
        "Can I book a table for lunch?",
        "Is there a time limit for lunch reservations?",
        "Do you accept reservations for private events?",
        "How can I make a reservation for a company event?",
        "Can I book a place for a wedding event at M Coffee Company?",
        "Do you have any special packages for specific events?",
        "How can I make a reservation for a group of tourists?",
        "Do you provide reservations for discussion or group meetings?",
        "Can I make reservations for children's birthday celebrations?",
        "Are there any specific requirements for making reservations at [venue]?",
        "Does [venue] accept table reservations?",
        "How can I make a reservation at [venue]?",
        "What are the requirements for booking a spot at [venue]?",
        "What is the reservation procedure at [venue]?",
        "Is there a time limit for making reservations at [venue]?",
        "How can I check the availability of seats for booking at [venue]?",
        "Does [venue] offer online reservation services?",
        "Does [venue] accept venue bookings for weddings?",
        "How can I modify or cancel a reservation at [venue]?",
        "Are there any special benefits to making a reservation at [venue]?",
        "What is the process for reserving a venue for large events at [venue]?",
        "What are the procedures for venue reservations at [venue] on holidays?",
        "Does [venue] provide reservation services for large groups?",
        "Is there a prepayment policy for reservations at [venue]?",
        "How can I check the status of my reservation at [venue]?",
        "Can I RSVP for an event at [venue]?",
        "What is the process for reserving a table at [venue]?",
        "Are there any specific requirements for making reservations at [venue] in the evening?",
        "How can I make an online reservation at [venue]?",
        "Does [venue] accept reservations over the phone?",
        "I would like to make a reservation, how can I do it?",
        "What is the procedure for online reservations at [venue]?",
        "Does [venue] accept advance reservations?",
        "How do I arrange a reservation at [venue]?",
        "What are the terms and conditions for making reservations at [venue]?",
        "How can I go about making a reservation at [venue]?",
        "Are there any special ways to make reservations at [venue]?",
        "Who should I contact to make a reservation at [venue]?",
        "Please provide guidance on making a reservation at [venue].",
        "Are there any specific requirements that must be met for reservations at [venue]?",
        "I want to make a table reservation, can you tell me the steps at [venue]?",
        "Does [venue] provide venue booking services?",
        "How can I secure a reservation at [venue]?",
        "Are there any restrictions on the number of guests for reservations at [venue]?",
        "How can I check the availability of seats at [venue] before making a reservation?",
        "Does [venue] accept online reservations?",
        "Are there any special benefits if I make a reservation at [venue]?",
        "What is the process for reserving a venue for special events at [venue]?",
        "Does [venue] provide venue reservation services for weddings?",
        "How can I cancel or modify a reservation at [venue]?",
        "Does [venue] have a prepayment policy for reservations?",
        "Is there a possibility of getting a discount when making a reservation at [venue]?",
        "Is there a time limit for reservations at [venue]?",
        "I would like to reserve a table at [venue], how can I do it?",
        "How can I check the availability of seats for reservations at [venue]?",
        "What is the process for venue reservations for large events at [venue]?",
        "How can I reserve a venue for a wedding at [venue]?",
        "How can I make a reservation at [venue]?",
        "How can I RSVP at [venue]?",
        "Are there any specific requirements for RSVPing at [venue]?",
        "How can I make an online reservation at [venue]?",
        "I would like to reserve a table at [venue], how can I do it?",
        "What are the benefits of RSVPing at [venue]?",
        "Does [venue] accept venue reservations?",
        "I am unsure how to make a reservation at [venue], can you help?",
        "What are the terms and conditions for making reservations at [venue]?",
        "How can I make reservations at [venue]?",
        "Does [venue] require upfront payment for reservations?",
        "How can I modify or cancel a reservation at [venue]?",
        "What are the benefits of making a reservation at [venue]?",
        "How can I reserve a venue for a corporate event at [venue]?",
        "I am planning to have a wedding at [venue], how can I make a venue reservation?",
        "How can I check the reservation status at [venue]?",
        "Can I RSVP at [venue]?",
        "How can I go about making a reservation at [venue]?",
        "What are the requirements for making reservations at [venue]?",
        "How do I make a reservation at [venue]?",
        "What are the specific requirements for reservations at [venue]?",
        "I want to make a reservation, how can I do it at [venue]?",
        "How can I make an online reservation at [venue]?",
        "Are there any time limits for reservations at [venue]?",
        "Can I reserve a table at your coffeeshop?",
        "Can I make a reservation at your establishment?",
        "What is your reservation policy?",
        "How far in advance do I need to make a reservation?",
        "How do I book a spot at your coffeeshop?",
        "Do you accept reservations for large groups?",
        "What is the maximum number of people I can reserve?",
        "How can I make an online reservation?",
        "What types of food and drinks can I order through reservations?",
        "Is there a time restriction for reservations at your coffeeshop?",
        "Do I need to make a prepayment when I make a reservation?",
        "Can I change or cancel my reservation?",
        "Are there specific times when you do not accept reservations?",
        "Are there any specific requirements for reservations at your coffeeshop?",
        "Do you accept reservations for birthday parties?",
        "How can I reserve a spot in the outdoor area of M Coffee Company?",
        "Are there any specific facilities that I can reserve?",
        "Can I make a reservation for a business meeting at M Coffee Company?",
        "How long is the available reservation time for each table?",
        "Are there strict time limits for reservations during peak hours?",
        "How can repeat visitors make reservations?",
        "Do you have special reservation policies for regular customers?",
        "Can I book a spot for a special event?",
        "Can I get a reservation for a table near the window?",
        "Do you accept reservations for live music events?",
        "How long can I hold a reservation before it gets canceled?",
        "Is there an age limit for making reservations?",
        "How can I view the menu before making a reservation?",
        "Is there an additional fee for making a reservation?",
        "Can I book a table for lunch?",
        "Is there a time limit for lunch reservations?",
        "Do you accept reservations for private events?",
        "How can I make a reservation for a company event?",
        "Can I reserve a venue for a wedding at your M Coffee Company?",
        "Do you have special packages for specific events?",
        "Can I RSVP?",
        "Can I make a reservation?",
        "What are the requirements for making a reservation?",
        "How do I make a reservation?",
        "What is the reservation process?",
        "How can I make a reservation?",
        "Where do I need to go to make a reservation?",
        "Please reserve a spot for me.",
        "How do I RSVP?",
        "What is the procedure for RSVPing?",
        "Are there any requirements for RSVPing?",
        "I'd like to make a reservation.",
        "RSVP, please.",
        "I want to reserve a spot.",
        "Can I RSVP at ?",
        "How can I make a reservation at ?",
        "What are the reservation requirements at ?",
        "What is the process for making a reservation at ?",
        "How do I make a reservation at ?",
        "Where do I go to make a reservation at ?",
        "I'd like to reserve a spot at .",
        "How do I RSVP at ?",
        "What is the RSVP process at ?",
        "Are there any specific requirements for RSVPing at ?",
        "I'd like to make a reservation at . Can you assist?",
        "I want to reserve a table at .",
        "How do I go about reserving a spot at ?",
        "I'd like to reserve a place for my wedding at . How can I do that?",
        "What are the requirements for making a reservation at ?",
        "How can I check the availability of spots at ?",
        "Do I need to pay in advance to make a reservation at ?",
        "How do I change or cancel my reservation at ?",
        "What are the benefits of making a reservation at ?",
        "How can I make a reservation for a large event at ?",
        "How can I reserve a place for a wedding event at ?",
        "How can I check the status of my reservation at ?",
        "Can I RSVP at ?",
        "Hey, does accept reservations?",
        "Can I make a reservation at ?",
        "How do I make a reservation at ?",
        "What are the requirements for making a reservation at ?",
        "How do I reserve a spot at ?",
        "Do I need any specific requirements to make a reservation at ?",
        "I'd like to make a reservation, how can I do that?",
        "How do I make an online reservation at ?",
        "Is there a deadline for making reservations at ?",
        "I'd like to reserve a table, how can I do that at ?",
        "How do I check the availability of spots for a reservation at ?",
        "How can I make a reservation for a large event at ?",
        "How do I reserve a place for a wedding event at ?",
        "How do I make a reservation at ?",
        "How do I RSVP at ?",
        "Are there any specific requirements for RSVPing at ?",
        "How do I make an online reservation at ?",
        "I'd like to reserve a table at . How can I do that?",
        "What are the benefits of RSVPing at ?",
        "Does accept reservations?",
        "I'm not sure how to make a reservation at , can you help?",
        "What are the terms and conditions for making reservations at ?",
        "What are the steps to make a reservation at ?",
        "Do I need to pay in advance for a reservation at ?",
        "How do I change or cancel my reservation at ?",
        "What benefits do I get from making a reservation at ?",
        "How can I make a reservation for a company event at ?",
        "I'm planning to have a wedding event at . How can I reserve a spot?",
        "How do I check the status of my reservation at ?",
        "Can I RSVP at ?",
        "How do I make a reservation at ?",
        "What are the requirements for making a reservation at ?",
        "How do I make a reservation at ?",
        "Do I need any specific requirements to make a reservation at ?",
        "I'd like to make a reservation, how can I do that?",
        "How do I make an online reservation at ?",
        "Is there a deadline for making reservations at ?",
        "I'd like to reserve a table, how can I do that at ?",
        "How do I check the availability of spots for a reservation at ?",
        "How can I make a reservation for a large event at ?",
        "How do I reserve a place for a wedding event at ?",
        "How do I make a reservation at ?",
        "How do I RSVP at ?",
        "Are there any specific requirements for RSVPing at ?",
        "How do I make an online reservation at ?",
        "I'd like to reserve a table at . How can I do that?",
        "What are the benefits of RSVPing at ?",
        "Does accept reservations?",
        "Can you recommend any drinks other than coffee at m company coffee?",
        "Is it possible for me to RSVP at m company coffee?",
        "How do I make a reservation at m company coffee?",
        "What are the requirements for making a reservation at m company coffee?",
        "What is the process for making a reservation at m company coffee?",
        "How can I make a reservation at m company coffee?",
        "Where do I go to make a reservation at m company coffee?",
        "I would like to make a reservation at m company coffee.",
        "How do I RSVP at m company coffee?",
        "What is the process for RSVP at m company coffee?",
        "Are there any requirements for RSVP at m company coffee?",
        "Can you help me with my reservation at m company coffee?",
        "I want to make a reservation for a dining spot at m company coffee.",
        "How can I make a reservation for a table at m company coffee?",
        "I want to make a reservation for a spot at m company coffee, how do I do it?",
        "How can I check the availability of spots for reservation at m company coffee?",
        "Is it necessary to pay in advance for a reservation at m company coffee?",
        "How can I change or cancel my reservation at m company coffee?",
        "Are there any benefits for making a reservation at m company coffee?",
        "How do I make a reservation for a large event at m company coffee?",
        "How do I make a reservation for a wedding event at m company coffee?",
        "How do I make a reservation for a business event at m company coffee?",
        "How can I check the status of my reservation at m company coffee? \"Can I RSVP at m company coffee?\"",
        "How can I check the status of my reservation at m company coffee?",
        "Am I able to RSVP at m company coffee?",
        "Are there any special requirements for making a reservation at m company coffee?",
        "I want to make a reservation, how do I do it?",
        "How do I make an online reservation at m company coffee?",
        "Are there any time limits for making a reservation at m company coffee?",
        "I want to make a reservation for a table, how do I do it at m company coffee?",
        "Are there any special benefits for those who make a reservation at m company coffee?",
        "I want to make a reservation for a business event, how do I do it at m company coffee?",
        "Are there any special menu options for reservations at m company coffee?",
        "I want to make a reservation for a VIP table, how do I do it at m company coffee?",
        "How do I make a reservation for a family event at m company coffee?",
        "How do I make a reservation for a birthday event at m company coffee?",
        "I want to make a reservation for an office event, how do I do it at m company coffee?",
        "How can I check the availability of spots for specific dates at m company coffee?",
        "Can I request a specific seating area for my reservation at m company coffee?",
        "Is it possible to make a group reservation at m company coffee?",
        "Are there any discounts for making a reservation at m company coffee?",
        "How do I make a reservation for a private event at m company coffee?",
        "Can I make a reservation for a specific time at m company coffee?",
        "Are there any special amenities for those with reservations at m company coffee?",
        "How can I get updates on my reservation at m company coffee?",
        "Can I make a reservation for outdoor seating at m company coffee?",
        "Are there any special deals for those who make a reservation at m company coffee?"
      ],
      "responses": [
        "For reservations, we have the following requirements:\n1. Reservations must be made 1 hour before arrival.\n2. Minimum order of 75k per person.\n3. If you do not arrive within 1 hour of the reserved time, your reservation will be automatically cancelled.\nIf you would like to make a reservation , you can click this link to fill in your information: https:......",
        "To make a reservation , please keep in mind the following requirements:\n1. Reservations must be made 1 hour before your arrival.\n2. The minimum order is 75k per person.\n3. If you are not arrive on time, your reservation will be automatically canceled.\nFor making a reservation , you can use this link to fill in your information: https:......"
      ]
    }
  ]
}
